{"title":"Combined feed","url":"https://objectprogr.github.io/feeds/all.xml","elements":[{"title":"Wszystko o portalu samorzad.gov.pl - Poradnik PRCyber - 06 (Cyberbezpieczny samorzad)","contents":"Krok po kroku, jak przystąpić do projektu (Grudzień 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/wszystko-o-portalu-samorzadgovpl","retrieved":1626175869083},{"title":"Cyberbezpieczne usługi chmurowe dla administracji publicznej - Poradnik PRCyber-05 (Cyberbezpieczny samorzad)","contents":"Środowisko informatyczne dostarczające usługi chmurowe oraz infrastrukturę IT za pośrednictwem Internetu (Listopad 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/cyberbezpieczne-uslugi-chmurowe-dla-administracji-publicznej---poradnik-prcyber-05","retrieved":1626175869084},{"title":"Jak sobie radzić ze skutkami ataków typu ransomware? – Poradnik PRCyber-04 (Cyberbezpieczny samorzad)","contents":"Ograniczenie skutków ataków typu ransomware (Sierpień 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/jak-sobie-radzic-ze-skutkami-atakow-typu-ransomware---poradnik--prcyber-04","retrieved":1626175869085},{"title":"Jak zapobiegać atakom typu ransomware? – Poradnik PRCyber-03 (Cyberbezpieczny samorzad)","contents":"Wskazówki dotyczące zabezpieczeń przed szkodliwym oprogramowaniem (Lipiec 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/jak-zapobiegac-atakom-typu-ransomware--poradnik-prcyber-03","retrieved":1626175869087},{"title":"Ochrona informacji w cyberprzestrzeni - Poradnik PRCyber-01 (Cyberbezpieczny samorzad)","contents":"Cyberbezpieczeństwo – jak chronić nasze informacje przed atakami w cyberprzestrzeni? (Maj 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/poradnik--prcyber-01","retrieved":1626175869088},{"title":"Zgłaszanie incydentów - Poradnik PRCyber-02 (Cyberbezpieczny samorzad)","contents":"Zgłaszanie incydentów przez jednostki samorządu terytorialnego (Maj 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/poradnik--prcyber-02","retrieved":1626175869089},{"title":"Subskrypcja cyberwiadomości (Cyberbezpieczny samorzad)","contents":"Formularz subskrypcji wiadomości z adresu CyberJST@mc.gov.pl (Czerwiec 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/subskrypcja-cyber-wiadomosci","retrieved":1626175869091},{"title":"Bezpieczni w mediach społecznościowych – poradnik (Cyberhigiena - dla kazdego)","contents":"W poradniku znajdują się wskazówki jak unikać włamań na konta w mediach społecznościowych oraz inne porady dotyczące cyberbezpieczeństwa. (Styczeń 2021 r.)","link":"https://www.gov.pl/web/baza-wiedzy/bezpieczni-w-mediach-spolecznosciowych--praktyczne-wskazowki","retrieved":1626176161556},{"title":"Media społecznościowe. Jak bezpiecznie z nich korzystać? (Cyberhigiena - dla kazdego)","contents":"Aby zarządzać swoimi cyfrowymi śladami, użyj ustawień prywatności na różnych platformach społecznościowych.","link":"https://www.gov.pl/web/baza-wiedzy/media-spolecznosciowe-jak-bezpiecznie-z-nich-korzystac","retrieved":1626176161558},{"title":"Korzystanie z urządzeń mobilnych (Cyberhigiena - dla kazdego)","contents":"Smartfony, laptopy, tablety – towarzyszą nam dzisiaj praktycznie na każdym kroku. Dlatego warto jest zadbać o bezpieczeństwo danych podczas korzystania z tych urządzeń.","link":"https://www.gov.pl/web/baza-wiedzy/korzystanie-z-urzadzen-mobilnych","retrieved":1626176161564},{"title":"Czym jest PHISHING i jak nie dać się nabrać na podejrzane wiadomości e-mail oraz SMS-y? (Cyberhigiena - dla kazdego)","contents":"Do oszustw w cyberprzestrzeni wykorzystywane są przede wszystkim ataki typu phishing!","link":"https://www.gov.pl/web/baza-wiedzy/czym-jest-phishing-i-jak-nie-dac-sie-nabrac-na-podejrzane-widomosci-e-mail-oraz-sms-y","retrieved":1626176161564},{"title":"Jak utworzyć bezpieczne hasło - wskazówki. (Cyberhigiena - dla kazdego)","contents":"Hasła są jednym z podstawowych sposobów, w jaki możemy udowodnić, kim jesteśmy. Używanie silnych haseł jest niezbędne aby chronić swoją tożsamość oraz informacje.","link":"https://www.gov.pl/web/baza-wiedzy/jak-tworzyc-bezpieczne-hasla","retrieved":1626176161565},{"title":"Konfigurowanie uwierzytelniania dwuskładnikowego (2FA) (Cyberhigiena - dla kazdego)","contents":"Uwierzytelnienie dwuskładnikowe (ang. Two Factor Authenticaton, 2FA) może pomóc chronić twoje konta internetowe.","link":"https://www.gov.pl/web/baza-wiedzy/konfigurowanie-uwierzytelniania-dwuskladnikowego-2fa","retrieved":1626176161565},{"title":"Zakupy online - jak nie dać się oszukać? (Cyberhigiena - dla kazdego)","contents":"Chcesz, żeby zakupy on-line były nie tylko szybkie i wygodne, ale także bezpieczne? Poznaj podstawowe zasady bezpiecznych zakupów.","link":"https://www.gov.pl/web/baza-wiedzy/zakupy-online---jak-nie-dac-sie-oszukac","retrieved":1626176161566},{"title":"E-usługi publiczne (Cyberhigiena - dla kazdego)","contents":"Polscy obywatele mogą korzystać z kilkuset e-usług publicznych zlokalizowanych na różnych platformach i portalach rządowych.","link":"https://www.gov.pl/web/baza-wiedzy/e-uslugi-publiczne","retrieved":1626176161568},{"title":"Zgłaszanie nielegalnych treści (Cyberhigiena - dla kazdego)","contents":"Reaguj, gdy widzisz niestosowne treści w sieci. Zespół Dyzurnet.pl podejmuje działania na rzecz tworzenia bezpiecznego Internetu.","link":"https://www.gov.pl/web/baza-wiedzy/zglaszanie-nielegalnych-tresci","retrieved":1626176161569},{"title":"Rozpoznawanie nieprawdziwych informacji (Cyberhigiena - dla kazdego)","contents":"Fake newsy – wpisy, wiadomości, kanały informacyjne, w których przekazywane dane okazują się nieprawdziwe lub przeinaczone.","link":"https://www.gov.pl/web/baza-wiedzy/rozpoznawanie-nieprawdziwych-informacji","retrieved":1626176161570},{"title":"Rekomendacje cyberbezpieczeństwa dla sektora wodno-kanalizacyjnego - R-CYBER-1/2021 (Dla profesjonalistow)","contents":"Zestaw zaleceń bezpieczeństwa podnoszących odporność przemysłowych systemów sterowania w obiektach świadczących usługi wodno-kanalizacyjne (Luty 2021 r.)","link":"https://www.gov.pl/web/baza-wiedzy/rekomendacje-cyberbezpieczenstwa-dla-sektora-wodno-kanalizacyjnego---r-cyber-12021-","retrieved":1626176160557},{"title":"Przedsiębiorco, zadbaj o bezpieczeństwo (Dla profesjonalistow)","contents":"Niezależnie od tego, czym się zajmujesz i ile osób zatrudniasz, jeśli w swojej firmie wykorzystujesz choćby jeden komputer lub używasz poczty elektronicznej - musisz pamiętać o cyberbezpieczeństwie. O czym konkretnie? Podpowiadamy. (Listopad 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/przedsiebiorco-zadbaj-o-bezpieczenstwo","retrieved":1626176160568},{"title":"Szablony sprawozdań z audytu dla operatorów usług kluczowych (Dla profesjonalistow)","contents":"Wzory szablonów sprawozdań z audytu bezpieczeństwa systemu informacyjnego zgodne z ustawą o krajowym systemie cyberbezpieczeństwa (Październik 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/szablony-audytu-dla-operatorow-uslug-kluczowych","retrieved":1626176160569},{"title":"Wprowadzenie podstawowych zasad zabezpieczeń na stacji roboczej z systemem Windows 10 (Dla profesjonalistow)","contents":"Komputery stacjonarne, czy służbowe laptopy coraz częściej narażone są na incydenty bezpieczeństwa (Maj 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/wprowadzenie-podstawowych-zasad-zabezpieczen-na-stacji-roboczej-z-systemem-windows-10","retrieved":1626176160570},{"title":"Praca zdalna - razem, ale osobno (Dla profesjonalistow)","contents":"Praca zdalna to nie urlop czy wypoczynek, ale praca. Tyle, że w domu (Maj 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/praca-zdalna---razem-ale-osobno","retrieved":1626176160571},{"title":"Zaawansowane metody tworzenia, stosowania i przechowywania bezpiecznych haseł (Dla profesjonalistow)","contents":"Dodatkowe porady dla bardziej zaawansowanych (Maj 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/zaawansowane-metody-tworzenia-stosowania-i-przechowywania-bezpiecznych-hasel","retrieved":1626176160572},{"title":"Poradnik dla nauczycieli – PR-EDU-01 (Dla profesjonalistow)","contents":"Bezpieczne korzystanie z platform do zdalnej edukacji (Kwiecień 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/poradnik-dla-nauczycieli--pr-edu-01--bezpieczne-korzystanie-z-platform-do-zdalnej-edukacji-kwiecien-2020","retrieved":1626176160574},{"title":"Poradnik – zgłaszanie incydentów cyberbezpieczeństwa przez podmioty sektora ochrony zdrowia (Dla profesjonalistow)","contents":"Poradnik informujący krok po kroku w jaki sposób i gdzie należy zgłaszać incydenty cyberbezpieczeństwa (Kwiecień 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/poradnik--zglaszanie-incydentow-cyberbezpieczenstwa-przez-podmioty-sektora-ochrony-zdrowia-kwiecien-2020-r","retrieved":1626176160576},{"title":"Poradnik – rekomendacje cyberbezpieczeństwa dla podmiotów sektora ochrony zdrowia (Dla profesjonalistow)","contents":"Zestaw rekomendowanych minimalnych środków przeciwdziałających skutkom incydentu cyberbezpieczeństwa (Kwiecień 2020 r.)","link":"https://www.gov.pl/web/baza-wiedzy/poradnik---rekomendacje-cyberbezpieczenstwa-dla-podmiotow-sektora-ochrony-zdrowia-kwiecien-2020-r","retrieved":1626176160578},{"title":"No code, no woman, no cry (Informatyk zakladowu)","contents":"<p>Temat dzisiejszego artykułu zaczął kształtować się, gdy pierwszy raz <a href=\"https://vas3k.com/blog/nocode/\">poznałem</a> (i wypróbowałem) możliwości dojrzałych narzędzi działających w modelu „programowania bez programowania”, czyli tzw. no-code. Założona teza brzmiała – serwisy te są na tyle dojrzałe i dają tyle swobody, że można przy ich użyciu przygotować interaktywne witryny nie umiejąc kodować. Potem przebyłem długą podróż, starając się ową tezę udowodnić. Poległem.</p>\n\n\n\n<p><strong>Środowiska do tworzenia projektów no-code są fajne, nawet bardzo fajne. Problem polega na tym, że obiecują więcej, niż są w stanie dostarczyć.</strong> Prosta automatyzacja – super. Innowacyjna baza danych współużywana przez kilka osób o różnych uprawnieniach – bez problemu. Prosta logika złożona z kilku decyzji i akcji? Tu pojawiają się schody.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/no-code-no-woman-no-cry/#more-2600\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„No code, no woman, no cry”</span></a></div>","link":"https://informatykzakladowy.pl/no-code-no-woman-no-cry/","retrieved":1626266975671},{"title":"Nie płać za kurs programowania (Informatyk zakladowu)","contents":"<p>Jest taka branża, w której zarobki są świetne, zlecenia płyną z całego świata a pracodawcy prześcigają się w pomysłach na zdobycie i zatrzymanie pracowników. Owszem, próg wejścia jest wysoki, bez sumienności i dokładności nie ma mowy o wynikach – za to opanowanie kilku rzadziej używanych technik i narzędzi sprawia, że pensja szybuje w kosmos.</p>\n\n\n\n<p>Mowa oczywiście o spawaniu podwodnym.</p>\n\n\n\n<p>Dlaczego nie widzimy natrętnych reklam divecampów, obiecujących gwarantowane zatrudnienie po półrocznym, intensywnym szkoleniu nurkowo-spawalniczym? Czemu nikt nie namawia do porzucenia obecnego stanowiska i rozpoczęcia suto płatnej podwodnej przygody? Pewnie dlatego, że większość ludzi boi się pływać, gdy nie sięga stopami dna, niewielu ma predyspozycje do bycia dobrym spawaczem a samo zajęcie jest dość niebezpieczne.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/nie-plac-za-kurs-programowania/#more-2585\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Nie płać za kurs programowania”</span></a></div>","link":"https://informatykzakladowy.pl/nie-plac-za-kurs-programowania/","retrieved":1626266975671},{"title":"Co zawierają QR-kody w Unijnym Certyfikacie Covid i jak to sprawdzić? (Informatyk zakladowu)","contents":"<p>Za niecałe dwa tygodnie Unia Europejska zacznie stosować <strong>Unijne Certyfikaty Covid</strong> zwane także <strong>paszportami covidowymi</strong> albo unijnymi cyfrowymi zaświadczeniami Covid (EU Digital COVID Certificates). Co jest zapisane w QR-kodzie, który znajduje się w tym dokumencie? Jak możemy to sami sprawdzić? W tym artykule rozbieramy temat na czynniki pierwsze. <strong>Roześlijcie link znajomym, którzy obawiają się zaświadczeń i panikują, że zawartość jest zakodowana, nieczytelna a rząd na pewno coś ukrywa.</strong></p>\n\n\n\n<p>Dzięki certyfikatom covidowym, zgodnym z <a href=\"https://eur-lex.europa.eu/legal-content/PL/TXT/?uri=CELEX:52021PC0130\">rozporządzeniem</a> Parlamentu Europejskiego, od <a href=\"https://www.gov.pl/web/szczepimysie/unijny-certyfikat-covid--kiedy-go-szukac-w-telefonie\">początku lipca</a> osoby zaszczepione, przetestowane i ozdrowiałe będą mogły przemieszczać się po Unii Europejskiej bez konieczności odbywania izolacji i kwarantanny. Jest to coś zupełnie co innego, niż wycofane z użycia rodzime zaświadczenia o szczepieniach. Tym razem nie ma mowy o częściowej anonimizacji danych, certyfikat covidowy zawiera imię, nazwisko i datę urodzenia. Co jeszcze powinniśmy wiedzieć?</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/co-zawieraja-qr-kody-w-unijnym-certyfikacie-covid-i-jak-to-sprawdzic/#more-2541\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Co zawierają QR-kody w Unijnym Certyfikacie Covid i jak to sprawdzić?”</span></a></div>","link":"https://informatykzakladowy.pl/co-zawieraja-qr-kody-w-unijnym-certyfikacie-covid-i-jak-to-sprawdzic/","retrieved":1626266975674},{"title":"Analiza popularności serwisu Albicla (Informatyk zakladowu)","contents":"<p>Założenie nowego serwisu społecznościowego nie jest rzeczą prostą – mówimy przecież o konkurowaniu z gigantami internetu, dysponującymi praktycznie nieskończoną ilością pieniędzy i rąk do pracy. Gdy określimy tworzony serwis jako „wolny od cenzury”, będzie jeszcze trudniej, bo przeżyjemy najazd trolli sprawdzających, czy cenzury faktycznie nie ma, a jeśli jest, to gdzie się zaczyna.</p>\n\n\n\n<p>Dziś przyglądamy się serwisowi Albicla.com – niemal pięć miesięcy po jego <a href=\"https://www.facebook.com/informatykzakladowy/posts/471649960866476\">trudnym starcie</a>. Spróbujemy wyznaczyć metryki opisujące społeczność Albicli, aktywność użytkowników, dynamikę zmian; poszukamy liderów w kilku różnych kategoriach. Sprawdzimy, ile naprawdę założono kont, ile z nich pozostaje aktywnych, jakiego typu treści są najbardziej popularne, i jeszcze więcej. Zaczynajmy!</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/analiza-popularnosci-serwisu-albicla/#more-2472\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Analiza popularności serwisu Albicla”</span></a></div>","link":"https://informatykzakladowy.pl/analiza-popularnosci-serwisu-albicla/","retrieved":1626266975675},{"title":"Laptop w roli drugiego monitora (Informatyk zakladowu)","contents":"<p>Już piętnaście lat temu programiści doceniali wygodę pracy zapewnianą przez dwa monitory. Wówczas wymagało to instalacji dodatkowej karty graficznej, dziś nawet proste układy wbudowane w płytę główną obsługują dwa lub trzy wyświetlacze. Często problemem jest jednak brak miejsca na biurku.</p>\n\n\n\n<p>Z takim właśnie wyzwaniem zetknąłem się podczas realizacji gawęd nadawanych na żywo. O ile jeden duży monitor jest w domu wystarczający do zabaw i rekreacji, o tyle podczas transmisji dobrze jest mieć na osobnym ekranie podgląd obrazu prezentowanego widzom – a dodatkowego miejsca na biurku nie miałem. Drugi monitor zastąpiłem więc… postawionym na szafce laptopem, który posłużył jako dodatkowy, bezprzewodowy wyświetlacz. Dziś pokażę, jak użyć tej funkcji w systemie Windows 10.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/laptop-w-roli-drugiego-monitora/#more-2436\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Laptop w roli drugiego monitora”</span></a></div>","link":"https://informatykzakladowy.pl/laptop-w-roli-drugiego-monitora/","retrieved":1626266975676},{"title":"Gawęda od zaplecza czyli domowe studio nagrań (Informatyk zakladowu)","contents":"<p>Gdy kilka miesięcy temu zastanawiałem się, jakiego sprzętu użyć do nagrania <a href=\"https://www.youtube.com/watch?v=IVEug1rk0rU\">pierwszej gawędy</a>, przewertowałem wiele poradników opisujących budowę domowego studia wideo. Zakres porad był zaskakująco szeroki, od „oprzyj telefon o kubek i nagrywaj” aż po „wybierając tańsze elementy wyposażenia zmieścimy się w kilkunastu tysiącach”.</p>\n\n\n\n<p>Poniżej opisuję moją konfigurację, która kosztowała w sumie kilkaset złotych i zdecydowanie wystarcza do youtubowania na poziomie ambitnego początkującego. <strong>Tak naprawdę chodzi przecież o treść – widzom wystarczy taka jakość transmisji, która nie będzie przeszkadzać w odbiorze.</strong> Sprzęt i oprogramowanie opisane w tym tekście posłużyły do nadawania <a href=\"https://www.youtube.com/watch?v=iRqEdzh-frw\">drugiej części gawędy</a> o kryptowalutach. Gdy kiedyś wymienię jakieś elementy wyposażenia, będziemy mogli zweryfikować osiągnięty efekt.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/gaweda-od-zaplecza-czyli-domowe-studio-nagran/#more-2406\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Gawęda od zaplecza czyli domowe studio nagrań”</span></a></div>","link":"https://informatykzakladowy.pl/gaweda-od-zaplecza-czyli-domowe-studio-nagran/","retrieved":1626266975677},{"title":"Zaproszenie na gawędę o Ethereum – piątek 21.05.2021, 20:00 (Informatyk zakladowu)","contents":"<p>Zapraszam Was na drugą gawędę poświęconą kryptowalutom. Tym razem przyjrzymy się dokładnie <a href=\"https://pl.wikipedia.org/wiki/Ethereum\">Ethereum</a> a ja opowiem, jakie cechy czynią to rozwiązanie tak ciekawym. Doświadczymy uczuć ambiwalentnych, bo niby mowa o projekcie ważnym i nowatorskim, ale z drugiej strony to między innymi przez wzrost wartości Ethereum nie możemy dziś kupić w normalnej cenie jakiejkolwiek karty graficznej.</p>\n\n\n\n<p>Planuję opowiedzieć o:</p>\n\n\n\n<ul><li>forkach kryptowalut (np. Bitcoin Classic / BXC)</li><li>Ethereum</li><li>smart kontraktach</li><li>tokenach.</li></ul>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><a href=\"https://youtu.be/iRqEdzh-frw\"><img loading=\"lazy\" src=\"https://informatykzakladowy.pl/wp-content/uploads/2021/05/obraz-1-1024x567.png\" alt=\"\" class=\"wp-image-2403\" srcset=\"https://informatykzakladowy.pl/wp-content/uploads/2021/05/obraz-1-1024x567.png 1024w, https://informatykzakladowy.pl/wp-content/uploads/2021/05/obraz-1-300x166.png 300w, https://informatykzakladowy.pl/wp-content/uploads/2021/05/obraz-1-768x425.png 768w, https://informatykzakladowy.pl/wp-content/uploads/2021/05/obraz-1.png 1028w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" width=\"1024\" height=\"567\"></a></figure></div>\n\n\n\n<p><strong>Transmisja odbędzie się na <a href=\"https://youtu.be/iRqEdzh-frw\">Youtube</a> w piątek 21.05.2021 o godzinie 20:00.</strong></p>\n\n\n\n<p>Nagranie będzie dostępne, natomiast plusem uczestnictwa w transmisji na żywo jest możliwość zadawania pytań (link do Slido pojawi się na początku gawędy). Uwaga – do zrozumienia materiału z części drugiej trzeba ogarniać treści z <a href=\"https://www.youtube.com/watch?v=IVEug1rk0rU\">części pierwszej</a>, nie będę ponownie wyjaśniał tam wprowadzonych koncepcji. Pozostałe ciekawe zagadnienia – jak ICO, NFT, Proof of Stake, anonimowość czy shitcoiny – pojawią się w części trzeciej.</p>","link":"https://informatykzakladowy.pl/zaproszenie-na-gawede-o-ethereum/","retrieved":1626266975681},{"title":"Ministerstwo zawarło umowę z Twitterem nawet, gdy o tym nie wie (Informatyk zakladowu)","contents":"<p>Nikogo nie dziwi, że kupno mieszkania czy samochodu wiąże się ze sporządzeniem pisemnej umowy. <a href=\"https://sip.lex.pl/akty-prawne/dzu-dziennik-ustaw/kodeks-cywilny-16785996/art-535\">Umowa sprzedaży</a> zostaje jednak zawarta również wtedy, gdy sprzedającemu i kupującemu wystarcza forma ustna, np. przy kupnie pieczywa czy lodów Ekipa (jest się na czasie, a co!). Relacja prawna pojawi się i w przypadku aktywności innego rodzaju – przy wynajęciu fachowca od remontów, rozpoczęciu podróży pojazdem komunikacji publicznej albo zakładaniu konta w serwisie społecznościowym.</p>\n\n\n\n<p>W dwóch ostatnich przypadkach treść umowy nie jest negocjowana między stronami, lecz wynika z regulaminu, stanowiącego <a href=\"https://sip.lex.pl/akty-prawne/dzu-dziennik-ustaw/kodeks-cywilny-16785996/art-384\">wzorzec umowy</a>. Możesz tego nie wiedzieć, ale jeśli masz konto w Facebooku i Twitterze, jesteś stroną umowy z irlandzkimi spółkami reprezentującymi tych gigantów w Unii Europejskiej. Niewiedza nie dziwi – od kilkudziesięciu lat klikamy bezrefleksyjnie wszystkie okienka dialogowe wyposażone w przycisk „Zgadzam się” lub „Akceptuję”.</p>\n\n\n\n<p>Gorzej, gdy nie wiedzą tego przedstawiciele polskiej administracji – oni akurat powinni byli starannie przestudiować treść proponowanego regulaminu. Czy to zrobili? Ha! Nie mam dobrych wiadomości.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/ministerstwo-zawarlo-umowe-z-twitterem-nawet-gdy-o-tym-nie-wie/#more-2371\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Ministerstwo zawarło umowę z Twitterem nawet, gdy o tym nie wie”</span></a></div>","link":"https://informatykzakladowy.pl/ministerstwo-zawarlo-umowe-z-twitterem-nawet-gdy-o-tym-nie-wie/","retrieved":1626266975685},{"title":"NIK o SLPS: Nie osiągnięto celów całego przedsięwzięcia (Informatyk zakladowu)","contents":"<p>W grudniu 2020 pisałem, w jaki sposób system informatyczny Ministerstwa Sprawiedliwości <a href=\"https://informatykzakladowy.pl/system-pseudolosowego-przydzialu-spraw/\">mógłby posłużyć do manipulacji</a> losowanymi składami sędziowskimi. Pokazałem, że temat losowości w komputerze jest bardzo trudny a mechanizm do ręcznego sterowania wybranymi losowaniami dałoby się przygotować tak, by w razie odkrycia wyglądał jak błąd niekompetentnego programisty.</p>\n\n\n\n<p>Miesiąc później opublikowano <a href=\"https://www.nik.gov.pl/kontrole/P/19/038/\">raport</a> Najwyższej Izby Kontroli opisujący m.in. System Losowego Przydziału Spraw. Czytamy w nim: „<em>na chwilę obecną w systemie SLPS brak jest mechanizmów zabezpieczających przed ewentualnymi, intencjonalnymi działaniami ograniczającymi „losowość” przydziału spraw referentom. </em>[…]<em> W konsekwencji możliwe jest dowolne dopasowanie raportów skróconych z losowania (zawierających wyłącznie informację o wylosowanym referacie) do innej dowolnej sprawy z tej samej kategorii.</em>”</p>\n\n\n\n<p>Niniejszy artykuł niemal w całości składa się z cytatów z raportu NIK. Jeśli wśród czytelników znajdzie się ktoś pracujący z systemami informatycznymi sądów, uprzejmie proszę o napisanie w komentarzu opinii, czy obserwowane w ostatnich latach metody informatyzacji wymiaru sprawiedliwości idą w dobrym kierunku. Po lekturze raportu trudno o optymizm…</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/nik-o-slps-nie-osiagnieto-celow-calego-przedsiewziecia/#more-2361\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„NIK o SLPS: Nie osiągnięto celów całego przedsięwzięcia”</span></a></div>","link":"https://informatykzakladowy.pl/nik-o-slps-nie-osiagnieto-celow-calego-przedsiewziecia/","retrieved":1626266975686},{"title":"Co nowego w Google Family Link (Informatyk zakladowu)","contents":"<p>Jednym z pierwszych artykułów opublikowanych na niniejszym blogu był <a href=\"https://informatykzakladowy.pl/zarzadzamy-telefonem-dziecka-kompletny-przewodnik-po-google-family-link/\">tekst o aplikacji Google Family Link</a>. Wciąż klika się on wyśmienicie, bo jest najbardziej kompletnym opisem tej apki w języku polskim. Dziś publikuję krótką informację o nowościach, które pojawiły się w Family Linku w marcu 2021.</p>\n\n\n\n<p>Mowa m.in. o liście zawsze dozwolonych aplikacji, które pozostają dostępne dla dziecka nawet po wyczerpaniu limitu czasu korzystania z urządzenia. Poprzednio jedyną taką funkcją było wykonywanie połączeń telefonicznych – teraz możemy dorzucić tam komunikatory, dzienniczek elektroniczny, Teams oraz inne aplikacje potrzebne do zdalnych lekcji.</p>\n\n\n\n <div class=\"read-more-button-wrap\"><a href=\"https://informatykzakladowy.pl/co-nowego-w-google-family-link/#more-2340\" class=\"more-link\"><span class=\"faux-button\">Kontynuuj czytanie</span> <span class=\"screen-reader-text\">„Co nowego w Google Family Link”</span></a></div>","link":"https://informatykzakladowy.pl/co-nowego-w-google-family-link/","retrieved":1626266975686},{"title":"Najnowszy iOS podatny na zdalne hackowanie (i instalację Pegasusa). Wystarczy wysłać jedną złośliwą wiadomość… (Sekurak)","contents":"Właśnie rozkręca się nowa afera z Pegasusem – zidentyfikowano ~50 000 numerów telefonicznych, które były w kręgu zainteresowań ~rządów. Na celowniku było m.in. ~180 dziennikarzy: They include the Wall Street Journal, CNN, the New York Times, Al Jazeera, France 24, Radio Free Europe, Mediapart, El País, Associated Press, Le Monde,…","link":"https://sekurak.pl/najnowszy-ios-podatny-na-zdalne-hackowanie-i-instalacje-pegasusa-wystarczy-wyslac-jedna-zlosliwa-wiadomosc/","retrieved":1626672837849},{"title":"DevilsTongue, czyli lepszy Pegasus od izraelskiej firmy Candiru (Sekurak)","contents":"Jakiś czas temu pisaliśmy o rosyjskim SWR, które wykorzystywało podatność w Safari do kradzieży ciasteczek autoryzujących z urządzeń ofiar. W raporcie Google’a możemy znaleźć również informacje dotyczące podatności w Google Chrome i Internet Explorer, które „zostały opracowane i sprzedane przez tego samego dostawcę, który zapewnia funkcje nadzoru klientom na całym…","link":"https://sekurak.pl/devilstongue-czyli-lepszy-pegasus-od-izraelskiej-firmy-candiru/","retrieved":1626457388367},{"title":"Rosyjskie SWR atakuje urzędników za pomocą wiadomości LinkedIn z 0-dayem do Safari (Sekurak)","contents":"Firma Google udostępniła ciekawy raport dotyczący czterech podatności typu 0-day, obejmujących przeglądarki: Google Chrome, Internet Explorer oraz Safari: Do zaatakowania użytkowników wyżej wymienionego oprogramowania posłużono się czterema exploitami w trzech niepowiązanych ze sobą kampaniach. Najciekawsza z nich dotyczyła wykorzystania podatności w Safari. Służba Wywiadu Zagranicznego Federacji Rosyjskiej (SWR) zaatakowała w…","link":"https://sekurak.pl/rosyjskie-swr-atakuje-urzednikow-za-pomoca-wiadomosci-linkedin-z-0-dayem-do-safari/","retrieved":1626457388368},{"title":"Zdjęto kanały na Telegramie gdzie publikowano treści z włamania na konto min. Dworczyka (Sekurak)","contents":"Na razie udało nam się pozyskać dość lakoniczną informację: W wyniku działań podjętych przez KPRM, kanały na których publikowano treści pozyskane w wyniku włamań na skrzynki min. Dworczyka, zostały zablokowane. Procedura trwała około miesiąca, wymagała analizy prawnej i technologicznej. Początkowo zdejmowane były poszczególne wiadomości, na przykład te ze zdjęciami dowodu…","link":"https://sekurak.pl/zdjeto-kanal-na-telegramie-gdzie-publikowano-tresci-z-wlamania-na-konto-min-dworczyka/","retrieved":1626413645879},{"title":"CVE-2021-22555: piętnastoletnia podatność w Linuksie, dająca eskalację uprawnień do root-a. Jest exploit. (Sekurak)","contents":"Ile jeszcze takich niespodzianek nas czeka? CVE-2021-22555 is a 15 years old heap out-of-bounds write vulnerability in Linux Netfilter that is powerful enough to bypass all modern security mitigations and achieve kernel code execution. Podatność (już załatana w kwietniu 2021) występuje w Netfilter i umożliwia sprawne uzyskanie uprawnień jądra z…","link":"https://sekurak.pl/cve-2021-22555-pietnastoletnia-podatnosc-w-linuksie-dajaca-eskalacje-uprawnien-do-root-a-jest-exploit/","retrieved":1626413645880},{"title":"Kuba: blackout Internetu i blokada mediów społecznościowych w trakcie antyrządowych protestów (Sekurak)","contents":"O tym, jak wielką siłę przebicia ma Internet, możemy przekonać się, obserwując działania współczesnej dyktatury na Kubie, która w ramach walki z trwającymi w całym kraju protestami postanowiła między innymi ograniczyć dostęp do Sieci: To jednak nie jedyna „atrakcja” przygotowana dla protestujących. Firma NetBlocks poinformowała, że główny dostawca usług telekomunikacyjnych…","link":"https://sekurak.pl/kuba-blackout-internetu-i-blokada-mediow-spolecznosciowych-w-trakcie-antyrzadowych-protestow/","retrieved":1626339760919},{"title":"Chińscy hakerzy wykorzystują exploit 0-day w SolarWinds Serv-U do atakowania podmiotów z sektora amerykańskiego przemysłu zbrojeniowego (Sekurak)","contents":"Kilka dni temu firma SolarWinds wydała łatkę do oprogramowania Serv-U Managed File Transfer Server oraz Serv-U Secured FTP. Podatność objęta poprawką pozwalała na zdalne wykonanie kodu: W biuletynie informacyjnym można znaleźć również informację o tym, że luka była wykorzystywana w atakach na wąską grupę użytkowników Serv-U: Nieco więcej możemy dowiedzieć…","link":"https://sekurak.pl/chinscy-hakerzy-wykorzystuja-exploit-0-day-w-solarwinds-serv-u-do-atakowania-podmiotow-z-sektora-amerykanskiego-przemyslu-zbrojeniowego/","retrieved":1626339760919},{"title":"Podmienione komunikaty na irańskich dworcach (Sekurak)","contents":"Techniczne skutki ataku na irańskie koleje nie są szczególnie istotne: A notice on electronic boards at stations asked travelers to call a number which in fact belonged to the office of Supreme Leader Ayatollah Ali Khamenei, IRIB and the semi-official news agency Fars said. Atakujący zamieszczali informacje o rzekomych opóźnieniach….","link":"https://sekurak.pl/podmienione-komunikaty-na-iranskich-dworcach/","retrieved":1626339760922},{"title":"Uwierzytelnianie/autoryzacja – co może pójść nie tak? Jak temu zapobiec? (Sekurak)","contents":"Zapraszamy na nasze unikalne szkolenie dotyczące właśnie problemów z uwierzytelnianiem oraz autoryzacją. W trakcie całości zobaczycie przeszło 50 realnych przykładów luk bezpieczeństwa występujących w tych mechanizmach. Będzie o: resetowaniu hasła, technikach brute force, oczywistych (albo i nie ;) metodach całkowitego ominięcia uwierzytelniania czy aspektach związanych z 2FA. Nie zabraknie też…","link":"https://sekurak.pl/uwierzytelnianie-autoryzacja-co-moze-pojsc-nie-tak-jak-temu-zapobiec/","retrieved":1626267507418},{"title":"Wyciek ze sklepu Spreadshirt: dane adresowe, hasła, „dane bankowe”, … (Sekurak)","contents":"Sklep Spreadshirt informuje o incydencie bezpieczeństwa, który dotyczy zarówno serwisu w wersji polskiej jak i międzynarodowej: Staliśmy się celem zorganizowanego cyberataku, który został przeprowadzony z zastosowaniem działań przestępczych. Nieznanym sprawcom udało się pokonać wysokie standardy bezpieczeństwa i uzyskać dostęp do wewnętrznych danych. Natychmiast podjęliśmy wszelkie niezbędne środki w celu ochrony…","link":"https://sekurak.pl/wyciek-ze-sklepu-spreadshirt-dane-adresowe-hasla-dane-bankowe/","retrieved":1626267507426},{"title":"Ukraińskie służby zlikwidowały największą „plantację” koparek kryptowalut… (Sekurak)","contents":"Z punktu widzenia funkcjonariuszy Służby Bezpieczeństwa Ukrainy (SBU) wszystko wskazywało na nielegalną plantację marihuany – duże zapotrzebowanie na prąd, liczniki energii elektrycznej, które nie pokazywały rzeczywistego zużycia energii, a także nietypowa lokalizacja – opuszczony magazyn, należący niegdyś do JSC Vinnytsiaoblenerho. Jak się jednak okazało, mieszkańcy Kijowa i Winnicy postawili na…","link":"https://sekurak.pl/ukrainskie-sluzby-zlikwidowaly-najwieksza-plantacje-koparek-kryptowalut/","retrieved":1626267507426},{"title":"Najciemniej jest pod latarnią, czyli zdalne wykonanie kodu w Microsoft Defenderze (CVE-2021-31985) (Sekurak)","contents":"Ten przypadek idealnie wpasowuje się w powiedzenie, że najciemniej jest pod latarnią. Badacz bezpieczeństwa Tavis Ormandy odkrył błąd pozwalający na zdalne wykonanie kodu we flagowym antywirusie Microsoft Defender: Według raportu słabym punktem Defendera jest kod do dekompresji i analizy tysięcy różnych formatów plików. Dlaczego? Bo antywirus wspiera setki rozmaitych formatów…","link":"https://sekurak.pl/najciemniej-jest-pod-latarnia-czyli-zdalne-wykonanie-kodu-w-microsoft-defenderze-cve-2021-31985/","retrieved":1626267507428},{"title":"Generowałeś automatycznie hasło w menadżerze haseł  od Kasperskiego? Lepiej je zmień… (Sekurak)","contents":"Menedżer haseł od rosyjskiej firmy Kaspersky jest stosunkowo intuicyjny i jak większość podobnych produktów pozwala przechowywać, synchronizować i generować hasła do aplikacji. Jeden z badaczy odkrył prosty, ale poważny błąd w ostatniej z wymienionych funkcji i zgłosił go za pośrednictwem HackerOne. Generowanie hasła odbywało się z wykorzystaniem aktualnego czasu w…","link":"https://sekurak.pl/generowales-automatycznie-haslo-w-menadzerze-hasel-od-kasperskiego-lepiej-je-zmien/","retrieved":1626267507429},{"title":"Zostań web security masterem – możliwość dostania ebooka i zniżka na trzy szkolenia Sekuraka (Sekurak)","contents":"Checie dostać za darmo ebook naszej książki „Bezpieczeństwo aplikacji webowych”? Dla pierwszych trzech osób, które zapiszą się na wszystkie trzy szkolenia z nowej serii sekuraka „Websecurity master” ebook naszej książki wysyłamy gratis! Seria „Websecurity master” to prawdziwa merytoryczna bomba w zakresie takich tematów jak uwierzytelnianie, autoryzacja, bezpieczeństwo JWT, nowoczesne mechanizmy…","link":"https://sekurak.pl/zostan-web-security-masterem-mozliwosc-dostania-ebooka-i-znizka-na-trzy-szkolenia-sekuraka/","retrieved":1626267507430},{"title":"Adversarial octopus, czyli atak na systemy rozpoznawania twarzy oparte na AI (Sekurak)","contents":"Jakiś czas temu badacze z firmy Adversa zaprezentowali dość ciekawą technikę ataku na systemy rozpoznawania twarzy: Adversarial octopus pozwala na podszywanie się pod wybraną przez nas ofiarę wobec systemów rozpoznawania twarzy opartych na sztucznej inteligencji. Dzieje się tak ze względu na niedoskonałości algorytmów rozpoznawania twarzy. Ten rodzaj ataku może zostać…","link":"https://sekurak.pl/adversarial-octopus-czyli-atak-na-systemy-rozpoznawania-twarzy-oparte-na-ai/","retrieved":1626267507431}]}