{"title":"Cyberhigiena - dla kazdego","url":"https://www.gov.pl/web/baza-wiedzy/cyberbezpieczenstwo","favicon":"https://www.gov.pl/img/icons/favicon-16x16.png","elements":[{"title":"Zajrzyj na pocztę","contents":"Wielu z nas ma przynajmniej jedno konto poczty e-mail. Mamy też takie, o których nawet nie pamiętamy. Zastanawialiście się kiedyś, co dzieje się z nieużywanym kontem? Odpowiadamy!","link":"https://www.gov.pl/web/baza-wiedzy/zajrzyj-na-poczte","retrieved":1626716573110},{"title":"Bezpieczna poczta e-mail – to trzeba wiedzieć!","contents":"E-mail to jedna z najpopularniejszych form komunikacji internetowej. Adres poczty elektronicznej to także identyfikator, którego używamy w trakcie logowania do różnych serwisów online. Dlatego warto wiedzieć, jak zadbać o bezpieczeństwo swojej poczty. Podpowiadamy, jak to zrobić.","link":"https://www.gov.pl/web/baza-wiedzy/bezpieczna-poczta-e-mail--to-trzeba-wiedziec","retrieved":1626716573112},{"title":"Postaw na backup","contents":"Przypadkowo usunięty dokument, złośliwe oprogramowanie lub uszkodzenie sprzętu – przyczyn utraty danych może być co najmniej kilka. W każdym przypadku konsekwencje są jednak takie same. Możesz ich uniknąć – rób kopie zapasowe.","link":"https://www.gov.pl/web/baza-wiedzy/postaw-na-backup","retrieved":1626716573117},{"title":"Korzystasz z internetu poza domem? Łącz się bezpiecznie!","contents":"Wielu z nas zdarza się korzystać z publicznych sieci wi-fi – w kawiarniach, hotelach, na dworcach czy w bibliotekach. To nie zawsze bezpieczne. Oto, na co zwracać uwagę.","link":"https://www.gov.pl/web/baza-wiedzy/korzystasz-z-internetu-poza-domem-lacz-sie-bezpiecznie","retrieved":1626716573118},{"title":"Chroń swoje Ja, czyli jak nie stracić tożsamości w sieci","contents":"Każda tożsamość jest unikalna. Twoja należy tylko do Ciebie – również online. Dokumenty i dane osobowe to przecież coś, czego nie „pożyczamy”, wręcz przeciwnie – chronimy je przed niepowołanym dostępem. Warto o tym pamiętać, także podczas korzystania z internetu.","link":"https://www.gov.pl/web/baza-wiedzy/chron-swoje-ja-czyli-jak-nie-stracic-tozsamosci-w-sieci","retrieved":1626716573119},{"title":"Dbaj o „zapasy”","contents":"Jeśli nie chcesz stracić dokumentów lub zdjęć, które trzymasz w komputerze lub telefonie – pamiętaj o kopiach zapasowych. Dziś Dzień Backupu. Podpowiadamy, jak go zrobić.","link":"https://www.gov.pl/web/baza-wiedzy/dbaj-o-zapasy","retrieved":1626716573120},{"title":"Dwa składniki, czyli przepis na cyberbezpieczeństwo","contents":"Hasła nie są już wystarczającym sposobem na ochronę naszych kont przed przejęciem ich przez cyberprzestępców. Warto stosować dodatkową weryfikację. Oto, o co chodzi i jak to działa.","link":"https://www.gov.pl/web/baza-wiedzy/dwa-skladniki-czyli-przepis-na-cyberbezpieczenstwo","retrieved":1626716573121},{"title":"J@k utw0rzyć bezp!eczne h@$ł0?","contents":"Hasło do poczty elektronicznej, konta w social mediach, do telefonu, komputera, bankowości elektronicznej... Jakie powinno być? Bezpieczne, silne i… do każdego konta inne! Oto wskazówki jak tego dokonać.","link":"https://www.gov.pl/web/baza-wiedzy/jk-utw0rzyc-bezpeczne-hl0","retrieved":1626716573136},{"title":"Bezpieczni w mediach społecznościowych – poradnik","contents":"W poradniku znajdują się wskazówki jak unikać włamań na konta w mediach społecznościowych oraz inne porady dotyczące cyberbezpieczeństwa. (Styczeń 2021 r.)","link":"https://www.gov.pl/web/baza-wiedzy/bezpieczni-w-mediach-spolecznosciowych--praktyczne-wskazowki","retrieved":1626176161556},{"title":"Media społecznościowe. Jak bezpiecznie z nich korzystać?","contents":"Aby zarządzać swoimi cyfrowymi śladami, użyj ustawień prywatności na różnych platformach społecznościowych.","link":"https://www.gov.pl/web/baza-wiedzy/media-spolecznosciowe-jak-bezpiecznie-z-nich-korzystac","retrieved":1626176161558}]}