{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Gmina Konstancin-Jeziorna w wyniku cyberataku straciła 5 mln PLN. Na celowniku kolejne gminy…","contents":"PAP donosi o następującym oszustwie: 5 mln zł zniknęło z lokaty założonej przez gminę Konstancin Jeziorna w jednym z banków – podaje portal piasecznonews.pl. Nie wiem, czy uda się odzyskać te pieniądze – komentuje burmistrz Kazimierz Jańczuk. Jak czytamy, pod koniec marca gmina założyła w jednym z banków lokatę na…","link":"https://sekurak.pl/gmina-konstancin-jeziorna-w-wyniku-cyberataku-stracila-5-mln-pln-na-celowniku-kolejne-gminy/","retrieved":1626802917062},{"title":"iPhone: zdalne wykonanie kodu bez interakcji z użytkownikiem, czyli niewinna luka z hotspotem „%p%s%s%s%s%n”","contents":"Jakiś czas temu pisaliśmy o ciekawym znalezisku badacza bezpieczeństwa Carla Schou: Dołączenie do hotspota o SSID „%p%s%s%s%s%n” sprawiało, że nasz iPhone nie był w stanie nawiązać połączenia z Wi-Fi, nawet jeśli został on ponownie uruchomiony lub gdy nazwa feralnego hotspota została zmieniona. Według Carla wykorzystanie wyżej wspomnianego błędu w praktyce…","link":"https://sekurak.pl/iphone-zdalne-wykonanie-kodu-bez-interakcji-z-uzytkownikiem-czyli-niewinna-luka-z-hotspotem-pssssn/","retrieved":1626716572706},{"title":"Najnowszy iOS podatny na zdalne hackowanie (i instalację Pegasusa). Wystarczy wysłać jedną złośliwą wiadomość…","contents":"Właśnie rozkręca się nowa afera z Pegasusem – zidentyfikowano ~50 000 numerów telefonicznych, które były w kręgu zainteresowań ~rządów. Na celowniku było m.in. ~180 dziennikarzy: They include the Wall Street Journal, CNN, the New York Times, Al Jazeera, France 24, Radio Free Europe, Mediapart, El País, Associated Press, Le Monde,…","link":"https://sekurak.pl/najnowszy-ios-podatny-na-zdalne-hackowanie-i-instalacje-pegasusa-wystarczy-wyslac-jedna-zlosliwa-wiadomosc/","retrieved":1626672837849},{"title":"DevilsTongue, czyli lepszy Pegasus od izraelskiej firmy Candiru","contents":"Jakiś czas temu pisaliśmy o rosyjskim SWR, które wykorzystywało podatność w Safari do kradzieży ciasteczek autoryzujących z urządzeń ofiar. W raporcie Google’a możemy znaleźć również informacje dotyczące podatności w Google Chrome i Internet Explorer, które „zostały opracowane i sprzedane przez tego samego dostawcę, który zapewnia funkcje nadzoru klientom na całym…","link":"https://sekurak.pl/devilstongue-czyli-lepszy-pegasus-od-izraelskiej-firmy-candiru/","retrieved":1626457388367},{"title":"Rosyjskie SWR atakuje urzędników za pomocą wiadomości LinkedIn z 0-dayem do Safari","contents":"Firma Google udostępniła ciekawy raport dotyczący czterech podatności typu 0-day, obejmujących przeglądarki: Google Chrome, Internet Explorer oraz Safari: Do zaatakowania użytkowników wyżej wymienionego oprogramowania posłużono się czterema exploitami w trzech niepowiązanych ze sobą kampaniach. Najciekawsza z nich dotyczyła wykorzystania podatności w Safari. Służba Wywiadu Zagranicznego Federacji Rosyjskiej (SWR) zaatakowała w…","link":"https://sekurak.pl/rosyjskie-swr-atakuje-urzednikow-za-pomoca-wiadomosci-linkedin-z-0-dayem-do-safari/","retrieved":1626457388368},{"title":"Zdjęto kanały na Telegramie gdzie publikowano treści z włamania na konto min. Dworczyka","contents":"Na razie udało nam się pozyskać dość lakoniczną informację: W wyniku działań podjętych przez KPRM, kanały na których publikowano treści pozyskane w wyniku włamań na skrzynki min. Dworczyka, zostały zablokowane. Procedura trwała około miesiąca, wymagała analizy prawnej i technologicznej. Początkowo zdejmowane były poszczególne wiadomości, na przykład te ze zdjęciami dowodu…","link":"https://sekurak.pl/zdjeto-kanal-na-telegramie-gdzie-publikowano-tresci-z-wlamania-na-konto-min-dworczyka/","retrieved":1626413645879},{"title":"CVE-2021-22555: piętnastoletnia podatność w Linuksie, dająca eskalację uprawnień do root-a. Jest exploit.","contents":"Ile jeszcze takich niespodzianek nas czeka? CVE-2021-22555 is a 15 years old heap out-of-bounds write vulnerability in Linux Netfilter that is powerful enough to bypass all modern security mitigations and achieve kernel code execution. Podatność (już załatana w kwietniu 2021) występuje w Netfilter i umożliwia sprawne uzyskanie uprawnień jądra z…","link":"https://sekurak.pl/cve-2021-22555-pietnastoletnia-podatnosc-w-linuksie-dajaca-eskalacje-uprawnien-do-root-a-jest-exploit/","retrieved":1626413645880},{"title":"Kuba: blackout Internetu i blokada mediów społecznościowych w trakcie antyrządowych protestów","contents":"O tym, jak wielką siłę przebicia ma Internet, możemy przekonać się, obserwując działania współczesnej dyktatury na Kubie, która w ramach walki z trwającymi w całym kraju protestami postanowiła między innymi ograniczyć dostęp do Sieci: To jednak nie jedyna „atrakcja” przygotowana dla protestujących. Firma NetBlocks poinformowała, że główny dostawca usług telekomunikacyjnych…","link":"https://sekurak.pl/kuba-blackout-internetu-i-blokada-mediow-spolecznosciowych-w-trakcie-antyrzadowych-protestow/","retrieved":1626339760919},{"title":"Chińscy hakerzy wykorzystują exploit 0-day w SolarWinds Serv-U do atakowania podmiotów z sektora amerykańskiego przemysłu zbrojeniowego","contents":"Kilka dni temu firma SolarWinds wydała łatkę do oprogramowania Serv-U Managed File Transfer Server oraz Serv-U Secured FTP. Podatność objęta poprawką pozwalała na zdalne wykonanie kodu: W biuletynie informacyjnym można znaleźć również informację o tym, że luka była wykorzystywana w atakach na wąską grupę użytkowników Serv-U: Nieco więcej możemy dowiedzieć…","link":"https://sekurak.pl/chinscy-hakerzy-wykorzystuja-exploit-0-day-w-solarwinds-serv-u-do-atakowania-podmiotow-z-sektora-amerykanskiego-przemyslu-zbrojeniowego/","retrieved":1626339760919},{"title":"Podmienione komunikaty na irańskich dworcach","contents":"Techniczne skutki ataku na irańskie koleje nie są szczególnie istotne: A notice on electronic boards at stations asked travelers to call a number which in fact belonged to the office of Supreme Leader Ayatollah Ali Khamenei, IRIB and the semi-official news agency Fars said. Atakujący zamieszczali informacje o rzekomych opóźnieniach….","link":"https://sekurak.pl/podmienione-komunikaty-na-iranskich-dworcach/","retrieved":1626339760922},{"title":"Uwierzytelnianie/autoryzacja – co może pójść nie tak? Jak temu zapobiec?","contents":"Zapraszamy na nasze unikalne szkolenie dotyczące właśnie problemów z uwierzytelnianiem oraz autoryzacją. W trakcie całości zobaczycie przeszło 50 realnych przykładów luk bezpieczeństwa występujących w tych mechanizmach. Będzie o: resetowaniu hasła, technikach brute force, oczywistych (albo i nie ;) metodach całkowitego ominięcia uwierzytelniania czy aspektach związanych z 2FA. Nie zabraknie też…","link":"https://sekurak.pl/uwierzytelnianie-autoryzacja-co-moze-pojsc-nie-tak-jak-temu-zapobiec/","retrieved":1626267507418},{"title":"Wyciek ze sklepu Spreadshirt: dane adresowe, hasła, „dane bankowe”, …","contents":"Sklep Spreadshirt informuje o incydencie bezpieczeństwa, który dotyczy zarówno serwisu w wersji polskiej jak i międzynarodowej: Staliśmy się celem zorganizowanego cyberataku, który został przeprowadzony z zastosowaniem działań przestępczych. Nieznanym sprawcom udało się pokonać wysokie standardy bezpieczeństwa i uzyskać dostęp do wewnętrznych danych. Natychmiast podjęliśmy wszelkie niezbędne środki w celu ochrony…","link":"https://sekurak.pl/wyciek-ze-sklepu-spreadshirt-dane-adresowe-hasla-dane-bankowe/","retrieved":1626267507426},{"title":"Ukraińskie służby zlikwidowały największą „plantację” koparek kryptowalut…","contents":"Z punktu widzenia funkcjonariuszy Służby Bezpieczeństwa Ukrainy (SBU) wszystko wskazywało na nielegalną plantację marihuany – duże zapotrzebowanie na prąd, liczniki energii elektrycznej, które nie pokazywały rzeczywistego zużycia energii, a także nietypowa lokalizacja – opuszczony magazyn, należący niegdyś do JSC Vinnytsiaoblenerho. Jak się jednak okazało, mieszkańcy Kijowa i Winnicy postawili na…","link":"https://sekurak.pl/ukrainskie-sluzby-zlikwidowaly-najwieksza-plantacje-koparek-kryptowalut/","retrieved":1626267507426},{"title":"Najciemniej jest pod latarnią, czyli zdalne wykonanie kodu w Microsoft Defenderze (CVE-2021-31985)","contents":"Ten przypadek idealnie wpasowuje się w powiedzenie, że najciemniej jest pod latarnią. Badacz bezpieczeństwa Tavis Ormandy odkrył błąd pozwalający na zdalne wykonanie kodu we flagowym antywirusie Microsoft Defender: Według raportu słabym punktem Defendera jest kod do dekompresji i analizy tysięcy różnych formatów plików. Dlaczego? Bo antywirus wspiera setki rozmaitych formatów…","link":"https://sekurak.pl/najciemniej-jest-pod-latarnia-czyli-zdalne-wykonanie-kodu-w-microsoft-defenderze-cve-2021-31985/","retrieved":1626267507428},{"title":"Generowałeś automatycznie hasło w menadżerze haseł  od Kasperskiego? Lepiej je zmień…","contents":"Menedżer haseł od rosyjskiej firmy Kaspersky jest stosunkowo intuicyjny i jak większość podobnych produktów pozwala przechowywać, synchronizować i generować hasła do aplikacji. Jeden z badaczy odkrył prosty, ale poważny błąd w ostatniej z wymienionych funkcji i zgłosił go za pośrednictwem HackerOne. Generowanie hasła odbywało się z wykorzystaniem aktualnego czasu w…","link":"https://sekurak.pl/generowales-automatycznie-haslo-w-menadzerze-hasel-od-kasperskiego-lepiej-je-zmien/","retrieved":1626267507429}]}