{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Wyciekły dane z sekretnej listy FBI, zawierającej ponad milion rekordów z informacjami o potencjalnych terrorystach","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą tweeta badacza bezpieczeństwa Boba Diachenki: Po atakach terrorystycznych z 11 września 2001 r. w Stanach Zjednoczonych utworzono TSC (Terrorist Screening Center), czyli wieloagencyjne centrum zarządzane przez FBI, którego głównym zadaniem jest uzupełnianie listy osób podejrzewanych o terroryzm i zarządzanie nią. Powyższe dane…","link":"https://sekurak.pl/wyciekly-dane-z-sekretnej-listy-fbi-zawierajacej-ponad-milion-rekordow-z-informacjami-o-potencjalnych-terrorystach/","retrieved":1629394893700},{"title":"Energetyczne, angażujące i aktualne szkolenie cyberawareness od sekuraka","contents":"Obawiacie się, że Wasi pracownicy mogą paść ofiarą socjotechniki/phishingu? Może przeleją firmowe pieniądze na konto przestępców? Nieświadomie wpuszczą ransomware do Waszej sieci? Albo udostępnią poufne informacje firmowe nieznajomym? Co z bezpieczeństwem smartfonów? Jeśli intrygują Was tego typu pytania, zobaczcie na nasze szkolenie cyberawareness przeznaczone dla osób nietechnicznych: bezpieczny.sekurak.pl Szkolenie sami…","link":"https://sekurak.pl/energetyczne-angazujace-i-aktualne-szkolenie-cyberawareness-od-sekuraka/","retrieved":1629394893702},{"title":"T-Mobile zhakowane – dane ponad 30 milionów klientów z USA są licytowane na forum cyberprzestępczym","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą oficjalnego oświadczenia, jakie firma T-Mobile zamieściła na swojej stronie internetowej: Z treści wypowiedzi wynika, że choć nieuprawniony dostęp do serwerów T-Mobile rzeczywiście miał miejsce, to firma nie ustaliła jeszcze, czy dane jej klientów zostały wykradzione.&nbsp; Niestety, jak informuje portal Vice, nielegalnie pozyskane…","link":"https://sekurak.pl/t-mobile-zhakowane-dane-ponad-30-milionow-klientow-z-usa-sa-licytowane-na-forum-cyberprzestepczym/","retrieved":1629308504017},{"title":"Policja aresztowała trzech Gruzinów podszywających się pod dostawców energii elektrycznej. Przestępcy ukradli ponad 450 tys. zł","contents":"Jeśli śledzicie na bieżąco kampanie cyberprzestępcze wycelowane w Polskę, to na pewno zetknęliście się z SMS-ami od „PGE” czy „Taurona”: Policjantom z Biura do Walki z Cyberprzestępczością Komendy Głównej Policji udało się jednak zatrzymać trzech obywateli Gruzji, którzy, podszywając się pod dużych dostawców energii elektrycznej, wyłudzali dane umożliwiające logowanie do…","link":"https://sekurak.pl/policja-aresztowala-trzech-gruzinow-podszywajacych-sie-pod-dostawcow-energii-elektrycznej-przestepcy-ukradli-ponad-450-tys-zl/","retrieved":1629308504018},{"title":"„Roboty z laserami, kamerami oraz brakiem zabezpieczeń” czyli hackowanie inteligentnych odkurzaczy","contents":"Podczas tegorocznej konferencji DEF CON Dennis Giese zaprezentował reverse engineering tzw. inteligentnych odkurzaczy produkowanych przez firmy Xiaomi i Roborock. Zapis prezentacji Robots with lasers and cameras (but no security): Liberating your vacuum został opublikowany na YouTubie. Badacz obecnie jest studentem Northeastern University; interesuje się inżynierią wsteczną. W prezentacji wyjaśniono, że…","link":"https://sekurak.pl/roboty-z-laserami-i-kamerami-i-brakiem-zabezpieczen-czyli-hackowanie-inteligentnych-odkurzaczy/","retrieved":1629135728445},{"title":"Facebook wprowadza szyfrowanie e2e rozmów głosowych i czatów wideo w Messengerze","contents":"Kilka dni temu dyrektor ds. zarządzania produktem (Messenger) Ruth Kricheli ogłosił dość ciekawe dla miłośników prywatności zmiany w komunikatorze Messenger: Pierwszą nowością jest szyfrowanie e2e (end-to-end) rozmów głosowych i wideo w Messengerze. W praktyce oznacza to, że nikt, w tym Facebook, nie powinien być w stanie podsłuchiwać treści naszych rozmów….","link":"https://sekurak.pl/facebook-wprowadza-szyfrowanie-e2e-rozmow-glosowych-i-czatow-wideo-w-messengerze/","retrieved":1629135728446},{"title":"Dziesiątki milionów urządzeń Amazon Kindle z krytyczną podatnością; poprawka gotowa i instalowana automatycznie","contents":"Researcherzy firmy Checkpoint wzięli jakiś czas temu pod lupę urządzenia Kindle firmy Amazon. Efekty ich pracy są bardzo ciekawe. Na podstawie ujawnionych podatności możliwe było przejęcie pełnej kontroli nad każdym tego typu urządzeniem. Po pobraniu na czytnik specjalnie spreparowanego e-booka (ileż to darmowych „okazji” krąży w sieci – tylko pobierać!)…","link":"https://sekurak.pl/dziesiatki-milionow-urzadzen-amazon-kindle-z-krytyczna-podatnoscia-poprawka-gotowa-i-instalowana-automatycznie/","retrieved":1628919272734},{"title":"Apple wprowadza masową inwigilację swoich użytkowników pod pozorem ochrony dzieci","contents":"Jeśli jesteście posiadaczami urządzeń z systemami iOS czy macOS, to prawdopodobnie jedną z wartości, którą sobie cenicie, stanowi prywatność. Szczyci się nią sama firma Apple: Niestety, ostatnia zapowiedź Apple’a nie rokuje zbyt dobrze w kontekście dbałości o prywatność użytkowników iOS’ów i macOS’ów: Pamiętacie próby przeforsowania ustaw o dodaniu furtek w…","link":"https://sekurak.pl/apple-wprowadza-masowa-inwigilacje-swoich-uzytkownikow-pod-pozorem-ochrony-dzieci/","retrieved":1628919272735},{"title":"Wprowadzenie do bezpieczeństwa IT – zobacz spis treści nowej książki sekuraka! :)","contents":"Po sukcesie pierwszej książki: Bezpieczeństwo aplikacji webowych (sprzedanych przeszło 16 000 sztuk), czas na drugą: Wprowadzenie do bezpieczeństwa IT. W założeniu książka kierowana jest do… wszystkich osób z IT :) i ma stanowić gładkie wprowadzenie do niemal każdego tematu, który można rozważać w ramach IT security. Przy czym nie ma…","link":"https://sekurak.pl/wprowadzenie-do-bezpieczenstwa-it-zobacz-spis-tresci-nowej-ksiazki-sekuraka/","retrieved":1628919272737},{"title":"Jak można było sobie dowolnie zwiększyć saldo portfela na platformie Steam? Krytyczna luka w Smart2Pay","contents":"Steam to jedna z największych i najpopularniejszych platform do dystrybucji cyfrowej gier komputerowych, stworzona przez Valve Corporation w 2003 roku. Jeśli jesteś graczem, to prawdopodobnie korzystasz z tego serwisu na co dzień… Oczywiście za gry w większości przypadków przyjdzie nam zapłacić, i to niemało, bo często nawet ~ 200 PLN:…","link":"https://sekurak.pl/jak-mozna-bylo-sobie-dowolnie-zwiekszyc-saldo-portfela-na-platformie-steam-krytyczna-luka-w-smart2pay/","retrieved":1628789977494},{"title":"Reżim Łukaszenki zhakowany przez grupę o nazwie Białoruscy Cyberpartyzanci. W rękach atakujących – dane agentów KGB i innych służb","contents":"Jeśli myślicie, że włamanie na skrzynkę ministra Dworczyka stanowiło kompromitację na skalę światową, to ostatni incydent na Białorusi prawdopodobnie zmieni Waszą opinię: Jak informuje dziennikarz Tadeusz Giczan, grupie Białoruscy Cyberpartyzanci udało się włamać na serwery Ministerstwa Spraw Wewnętrznych Republiki Białorusi oraz tamtejszej policji. W ten sposób haktywiści przejęli między innymi…","link":"https://sekurak.pl/rezim-lukaszenki-zhakowany-przez-grupe-o-nazwie-bialoruscy-cyberpartyzanci-w-rekach-atakujacych-dane-agentow-kgb-i-innych-sluzb/","retrieved":1628703892855},{"title":"Atak grupy ransomware’owej RansomEXX na producenta płyt głównych Gigabyte","contents":"Gigabyte Technology Co., Ltd. to tajwańskie przedsiębiorstwo zajmujące się produkcją sprzętu komputerowego. Firma znana jest przede wszystkim z wytwarzania płyt głównych, choć produkuje również urządzenia peryferyjne, sieciowe, notebooki oraz serwery: Jak się jednak okazało, firma Gigabyte padła ofiarą ataku grupy ransomware’owej RansomEXX: Kwota okupu nie jest jeszcze znana. Wiadomo jednak,…","link":"https://sekurak.pl/atak-grupy-ransomwareowej-ransomexx-na-producenta-plyt-glownych-gigabyte/","retrieved":1628530999013},{"title":"Chcesz z nami legalnie pohackować Protonmaila (i inne ciekawe systemy)? Zapraszamy! [praca w Sekurak/Securitum]","contents":"Ostatnio wykonaliśmy testy bezpieczeństwa Protonmaila (tutaj zobacz raport, który za zgodą zamawiających te pentesty – został upubliczniony). Jeśli chciałbyś uczestniczyć w tego typu ofensywnych projektach – czytaj dalej :-) No więc wracając do tytułu, rocznie w Securitum realizujemy około 400 testów bezpieczeństwa – w tym dla międzynarodowych korporacji i mimo…","link":"https://sekurak.pl/chcesz-z-nami-legalnie-pohackowac-protonmaila-i-inne-ciekawe-systemy-zapraszamy/","retrieved":1628185285294},{"title":"Atak ransomware’owy na systemy IT regionu Lacjum we Włoszech. Nieczynny portal umożliwiający rejestrację na szczepienia przeciw COVID-19","contents":"Jak możemy dowiedzieć się za sprawą oświadczenia zamieszczonego na Facebooku przez prezydenta Lacjum Nicolę Zingarettiego, systemy informatyczne włoskiego regionu padły ofiarą cyberataku, a konkretniej – ransomware’a: W wyniku incydentu wyłączony został między innymi portal umożliwiający mieszkańcom regionu rejestrację na szczepienie przeciwko COVID-19: „[…] W ciągu najbliższych kilku dni rezerwacje na…","link":"https://sekurak.pl/atak-ransomwareowy-na-systemy-it-regionu-lacjum-we-wloszech-nieczynny-portal-umozliwiajacy-rejestracje-na-szczepienia-przeciw-covid-19/","retrieved":1628099036377},{"title":"Luka bezpieczeństwa w mechanizmie logowania w portalu edukacyjnym Uniwersytetu Gdańskiego","contents":"W 2021 roku programiści mają ułatwione zadanie, jeśli chodzi o utrzymanie bezpieczeństwa swojego dzieła. Frameworki frontendowe pokroju Reacta czy Angulara eliminują w większości przypadków XSS-y, zaś gdy mówimy o backendzie, to Laravel czy ASP.NET Core umożliwiają wygenerowanie projektu z gotowym i względnie bezpiecznym systemem logowania oraz rejestracji użytkowników. Niestety, systemy…","link":"https://sekurak.pl/luka-bezpieczenstwa-w-mechanizmie-logowania-w-portalu-edukacyjnym-uniwersytetu-gdanskiego/","retrieved":1628012914561}]}