{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Kuba: blackout Internetu i blokada mediów społecznościowych w trakcie antyrządowych protestów","contents":"O tym, jak wielką siłę przebicia ma Internet, możemy przekonać się, obserwując działania współczesnej dyktatury na Kubie, która w ramach walki z trwającymi w całym kraju protestami postanowiła między innymi ograniczyć dostęp do Sieci: To jednak nie jedyna „atrakcja” przygotowana dla protestujących. Firma NetBlocks poinformowała, że główny dostawca usług telekomunikacyjnych…","link":"https://sekurak.pl/kuba-blackout-internetu-i-blokada-mediow-spolecznosciowych-w-trakcie-antyrzadowych-protestow/","retrieved":1626339760919},{"title":"Chińscy hakerzy wykorzystują exploit 0-day w SolarWinds Serv-U do atakowania podmiotów z sektora amerykańskiego przemysłu zbrojeniowego","contents":"Kilka dni temu firma SolarWinds wydała łatkę do oprogramowania Serv-U Managed File Transfer Server oraz Serv-U Secured FTP. Podatność objęta poprawką pozwalała na zdalne wykonanie kodu: W biuletynie informacyjnym można znaleźć również informację o tym, że luka była wykorzystywana w atakach na wąską grupę użytkowników Serv-U: Nieco więcej możemy dowiedzieć…","link":"https://sekurak.pl/chinscy-hakerzy-wykorzystuja-exploit-0-day-w-solarwinds-serv-u-do-atakowania-podmiotow-z-sektora-amerykanskiego-przemyslu-zbrojeniowego/","retrieved":1626339760919},{"title":"Podmienione komunikaty na irańskich dworcach","contents":"Techniczne skutki ataku na irańskie koleje nie są szczególnie istotne: A notice on electronic boards at stations asked travelers to call a number which in fact belonged to the office of Supreme Leader Ayatollah Ali Khamenei, IRIB and the semi-official news agency Fars said. Atakujący zamieszczali informacje o rzekomych opóźnieniach….","link":"https://sekurak.pl/podmienione-komunikaty-na-iranskich-dworcach/","retrieved":1626339760922},{"title":"Uwierzytelnianie/autoryzacja – co może pójść nie tak? Jak temu zapobiec?","contents":"Zapraszamy na nasze unikalne szkolenie dotyczące właśnie problemów z uwierzytelnianiem oraz autoryzacją. W trakcie całości zobaczycie przeszło 50 realnych przykładów luk bezpieczeństwa występujących w tych mechanizmach. Będzie o: resetowaniu hasła, technikach brute force, oczywistych (albo i nie ;) metodach całkowitego ominięcia uwierzytelniania czy aspektach związanych z 2FA. Nie zabraknie też…","link":"https://sekurak.pl/uwierzytelnianie-autoryzacja-co-moze-pojsc-nie-tak-jak-temu-zapobiec/","retrieved":1626267507418},{"title":"Wyciek ze sklepu Spreadshirt: dane adresowe, hasła, „dane bankowe”, …","contents":"Sklep Spreadshirt informuje o incydencie bezpieczeństwa, który dotyczy zarówno serwisu w wersji polskiej jak i międzynarodowej: Staliśmy się celem zorganizowanego cyberataku, który został przeprowadzony z zastosowaniem działań przestępczych. Nieznanym sprawcom udało się pokonać wysokie standardy bezpieczeństwa i uzyskać dostęp do wewnętrznych danych. Natychmiast podjęliśmy wszelkie niezbędne środki w celu ochrony…","link":"https://sekurak.pl/wyciek-ze-sklepu-spreadshirt-dane-adresowe-hasla-dane-bankowe/","retrieved":1626267507426},{"title":"Ukraińskie służby zlikwidowały największą „plantację” koparek kryptowalut…","contents":"Z punktu widzenia funkcjonariuszy Służby Bezpieczeństwa Ukrainy (SBU) wszystko wskazywało na nielegalną plantację marihuany – duże zapotrzebowanie na prąd, liczniki energii elektrycznej, które nie pokazywały rzeczywistego zużycia energii, a także nietypowa lokalizacja – opuszczony magazyn, należący niegdyś do JSC Vinnytsiaoblenerho. Jak się jednak okazało, mieszkańcy Kijowa i Winnicy postawili na…","link":"https://sekurak.pl/ukrainskie-sluzby-zlikwidowaly-najwieksza-plantacje-koparek-kryptowalut/","retrieved":1626267507426},{"title":"Najciemniej jest pod latarnią, czyli zdalne wykonanie kodu w Microsoft Defenderze (CVE-2021-31985)","contents":"Ten przypadek idealnie wpasowuje się w powiedzenie, że najciemniej jest pod latarnią. Badacz bezpieczeństwa Tavis Ormandy odkrył błąd pozwalający na zdalne wykonanie kodu we flagowym antywirusie Microsoft Defender: Według raportu słabym punktem Defendera jest kod do dekompresji i analizy tysięcy różnych formatów plików. Dlaczego? Bo antywirus wspiera setki rozmaitych formatów…","link":"https://sekurak.pl/najciemniej-jest-pod-latarnia-czyli-zdalne-wykonanie-kodu-w-microsoft-defenderze-cve-2021-31985/","retrieved":1626267507428},{"title":"Generowałeś automatycznie hasło w menadżerze haseł  od Kasperskiego? Lepiej je zmień…","contents":"Menedżer haseł od rosyjskiej firmy Kaspersky jest stosunkowo intuicyjny i jak większość podobnych produktów pozwala przechowywać, synchronizować i generować hasła do aplikacji. Jeden z badaczy odkrył prosty, ale poważny błąd w ostatniej z wymienionych funkcji i zgłosił go za pośrednictwem HackerOne. Generowanie hasła odbywało się z wykorzystaniem aktualnego czasu w…","link":"https://sekurak.pl/generowales-automatycznie-haslo-w-menadzerze-hasel-od-kasperskiego-lepiej-je-zmien/","retrieved":1626267507429},{"title":"Zostań web security masterem – możliwość dostania ebooka i zniżka na trzy szkolenia Sekuraka","contents":"Checie dostać za darmo ebook naszej książki „Bezpieczeństwo aplikacji webowych”? Dla pierwszych trzech osób, które zapiszą się na wszystkie trzy szkolenia z nowej serii sekuraka „Websecurity master” ebook naszej książki wysyłamy gratis! Seria „Websecurity master” to prawdziwa merytoryczna bomba w zakresie takich tematów jak uwierzytelnianie, autoryzacja, bezpieczeństwo JWT, nowoczesne mechanizmy…","link":"https://sekurak.pl/zostan-web-security-masterem-mozliwosc-dostania-ebooka-i-znizka-na-trzy-szkolenia-sekuraka/","retrieved":1626267507430},{"title":"Adversarial octopus, czyli atak na systemy rozpoznawania twarzy oparte na AI","contents":"Jakiś czas temu badacze z firmy Adversa zaprezentowali dość ciekawą technikę ataku na systemy rozpoznawania twarzy: Adversarial octopus pozwala na podszywanie się pod wybraną przez nas ofiarę wobec systemów rozpoznawania twarzy opartych na sztucznej inteligencji. Dzieje się tak ze względu na niedoskonałości algorytmów rozpoznawania twarzy. Ten rodzaj ataku może zostać…","link":"https://sekurak.pl/adversarial-octopus-czyli-atak-na-systemy-rozpoznawania-twarzy-oparte-na-ai/","retrieved":1626267507431},{"title":"Microsoft wypuścił łatkę do krytycznej podatności PrintNightmare (CVE-2021-34527)","contents":"Jakiś czas temu pisaliśmy o podatności w Windows Print Spooler (CVE-2021-1675), która okazała się krytyczną luką, pozwalającą zarówno na zdalne wykonanie kodu, jak i na eskalację uprawnień na systemach Windows: Nie pomogła również wpadka badaczy bezpieczeństwa, którzy przez przypadek opublikowali POC oraz szczegółowe objaśnienie podatności: Choć repozytorium zostało dość szybko…","link":"https://sekurak.pl/microsoft-wypuscil-latke-do-krytycznej-podatnosci-printnightmare-cve-2021-34527/","retrieved":1626267507432},{"title":"Irlandzki sąd nakazał serwisowi VirusTotal udostępnienie informacji o osobach, które pobrały dane wykradzione z HSE","contents":"Jakiś czas temu pisaliśmy o ataku ransomware’a Conti na szereg szpitali i klinik na terenie Irlandii: W ramach modelu podwójnego wymuszenia (double extortion) przestępcy wykradli również 700 GB danych, zawierających między innymi informacje o pacjentach i pracownikach, umowach czy sprawozdaniach finansowych.&nbsp; Nie jest tajemnicą fakt, że operatorzy ransomware zazwyczaj oferują…","link":"https://sekurak.pl/irlandzki-sad-nakazal-serwisowi-virustotal-udostepnienie-informacji-o-osobach-ktore-pobraly-dane-wykradzione-z-hse/","retrieved":1626267507433},{"title":"Jak ransomware dostaje się do firm? Publikujemy nasze ~2.5-godzinne szkolenie","contents":"Prowadzi Michał Sajdak oraz Grzegorz Tworek. Na początek trochę teorii, później sporo praktyki (głównie jeśli chodzi o bezpieczeństwo Windows). Miłego oglądania: –ms","link":"https://sekurak.pl/jak-ransomware-dostaje-sie-do-firm-publikujemy-nasze-2-5-godzinne-szkolenie/","retrieved":1626267507435},{"title":"Wykonaliśmy testy penetracyjne Protonmaila – zobaczcie publiczny raport","contents":"Na zlecenie Protonmaila wykonaliśmy testy bezpieczeństwa Protonmaila :) Dokładny zakres opisujemy w przeszło 40-stronicowym raporcie. Oczywiście jeśli chcielibyście zlecić tego typu prace dla Waszych systemów czy aplikacji – kontaktujcie się na securitum@securitum.pl –ms","link":"https://sekurak.pl/wykonalismy-testy-penetracyjne-protonmaila-zobaczcie-publiczny-raport/","retrieved":1626267507439},{"title":"800 sklepów sieci supermarketów Coop dotkniętych atakiem ransomware’owym REvil","contents":"Kilka dni temu informowaliśmy o ataku na firmę Kaseya, która dostarcza oprogramowanie do zarządzania IT. Jak wynika z doniesień huntresslabs, cyberprzestępcy wykorzystali błędy logiki biznesowej i SQL injection we flagowym produkcie firmy – Kaseya VSA: Choć wieści o poszkodowanych firmach będą na bieżąco wypływać do opinii publicznej, to już teraz…","link":"https://sekurak.pl/800-sklepow-sieci-supermarketow-coop-dotknietych-atakiem-ransomwareowym-revil/","retrieved":1626267507441}]}