{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"16-letnia podatność w sterownikach niektórych drukarek","contents":"Podatność CVE-2021-3438 została odkryta niedawno, bo 18 lutego, ale w kodach źródłowych sterowników znajdowała się od 16 lat. Dotyczy ona jedynie starszych modeli drukarek HP, Samsung i Xerox. Niestety nie oznacza to, że luka nie jest poważna, bo obejmuje stosunkowo popularne modele (łącznie około 400). Wykorzystanie podatności pozwala na podniesienie…","link":"https://sekurak.pl/16-letnia-podatnosc-w-sterownikach-niektorych-drukarek/","retrieved":1627321266720},{"title":"Kaseya otrzymała uniwersalny dekryptor, pozwalający na odszyfrowanie danych wszystkich ofiar incydentu","contents":"Na początku lipca informowaliśmy Was o ataku na firmę Kaseya, która dostarcza oprogramowanie do zarządzania IT: Przestępcy za odszyfrowanie danych zażądali horrendalnej kwoty 70 milionów dolarów: Sytuacja stała się jeszcze bardziej napięta po tajemniczym „zniknięciu” grupy: Według przedstawiciela innej grupy ransomware’owej operatorzy REvil otrzymali swoiste ultimatum od lokalnych władz, zmuszające…","link":"https://sekurak.pl/kaseya-otrzymala-uniwersalny-dekryptor-pozwalajacy-na-odszyfrowanie-danych-wszystkich-ofiar-incydentu/","retrieved":1627062143729},{"title":"UWAGA – duża awaria DNSów Akamai. Nie działają serwisy: Airbnb, Steam, Lastpass, FedEx, SalesForce, …","contents":"Tutaj prawdopodobna przyczyna, którą Akamai opisuje tak: Investigating – We are aware of an emerging issue with the Edge DNS service. We are actively investigating the issue. If you have questions or are experiencing impact due to this issue, please contact Akamai Technical Support. In the interest of time, we…","link":"https://sekurak.pl/uwaga-duza-awaria-dnsow-akamai-nie-dzialaja-serwisy-airbnb-steam-lastpass-fedex-salesforce/","retrieved":1626975770607},{"title":"iOS 14.7 z poprawkami do 37 błędów bezpieczeństwa, patchuj teraz!","contents":"Od poniedziałku użytkownicy iPhone’ów oraz iPadów mogą cieszyć się aktualizacją 14.7 systemu iOS. Zawiera ona łatki do szeregu krytycznych podatności bezpieczeństwa, pozwalających między innymi na zdalne wykonanie kodu oraz eskalację uprawnień: Poprawka obejmuje również opisywany przez nas błąd z hotspotem o SSID „%p%s%s%s%s%n”, za sprawą którego nasz iPhone nie był…","link":"https://sekurak.pl/ios-14-7-z-poprawkami-do-37-bledow-bezpieczenstwa-patchuj-teraz/","retrieved":1626975770607},{"title":"Ransomware dostał się przez „fałszywą aktualizację przeglądarki”. Zaszyfrowane ~15000 systemów.","contents":"Chodzi o atak który miał miejsce w marcu tego roku, a ofiarą był jeden z większych ubezpieczycieli w USA – CNA Financial. Wg relacji, jeden z pracowników pobrał „fałszywą aktualizację przeglądarki” z (o dziwo) normalnego serwisu (może wstrzyknięta złośliwa reklama?). Następnie atakujący podnieśli uprawnienia do administratora. Następnie rekonesans i pełne…","link":"https://sekurak.pl/ransomware-dostal-sie-przez-falszywa-aktualizacje-przegladarki-zaszyfrowane-15000-systemow/","retrieved":1626975770607},{"title":"Kilka komentarzy odnośnie ostatniej afery z Pegasusem","contents":"Ostatnio znane oprogramowanie do inwigilacji ponownie stało się tematem artykułów. Wbrew pozorom zwykły obywatel przypuszczalnie nie musi obawiać się infekcji Pegasusem. Utrzymanie jego „lokalnej” infrastruktury wymaga sporych nakładów finansowych, więc to oprogramowanie jest w pewnym sensie zarezerwowane dla najistotniejszych celów. Zdecydowanie większe zagrożenie stanowi zwykły malware. Natomiast dowiadujemy się kilku…","link":"https://sekurak.pl/kilka-komentarzy-odnosnie-ostatniej-afery-z-pegasusem/","retrieved":1626975770611},{"title":"Sequoia – nowa podatność klasy priv escalation na Linuksa. Exploit działa na  Debiana 11, Ubuntu 20.10, Ubuntu 21.04 i wiele innych","contents":"Miejcie rękę na pulsie w temacie łatania luki CVE-2021-33909. Techniczny opis podatności dostępny jest tutaj, a badacze z Qualysa dodają, że podatność istnieje od 2014 roku (Linux 3.16). Na razie opublikowali prostego PoC exploita (crash), ale niebawem ma pokazać się pełen exploit. Luka, jak wspomniałem w tytule, umożliwia eskalację uprawnień…","link":"https://sekurak.pl/sequoia-nowa-podatnosc-klasy-priv-escalation-na-linuksa-exploit-dziala-na-debiana-11-ubuntu-20-10-ubuntu-21-04-i-wiele-innych/","retrieved":1626932059653},{"title":"Jak stosować nowoczesne mechanizmy przeglądarkowe w celu zabezpieczenia aplikacji webowej?","contents":"Już w najbliższy piątek o 09:00 Michał Bentkowski poprowadzi unikalne szkolenie o wykorzystaniu nowoczesnych mechanizmów przeglądarkowych w celu lepszego zabezpieczenia aplikacji webowych. W ostatnich latach twórcy przeglądarek wprowadzili szereg mechanizmów, które pozwalają na lepsze zabezpieczenie aplikacji WWW przed atakami i pozwalają na lepsze zabezpieczenie danych użytkowników. Niektóre z nich są…","link":"https://sekurak.pl/jak-stosowac-nowoczesne-mechanizmy-przegladarkowe-w-celu-zabezpieczenia-aplikacji-webowej/","retrieved":1626932059657},{"title":"Podatność Serious Sam, czyli wpadka Microsoftu z uprawnieniami do pliku SAM – eskalacja uprawnień Windows 10/11","contents":"Ostatnie miesiące nie były najlepsze dla Microsoftu – jeśli mówimy o błędach bezpieczeństwa – czego żywym dowodem jest znalezisko Jonasa Lykkegraarda: Badacz odkrył trywialny błąd, który pozwala nieuprzywilejowanemu użytkownikowi na odczytanie plików SAM, SYSTEM czy SECURITY. Innymi słowy – zwykły użytkownik, nie będący administratorem, jest w stanie odczytać sekrety systemu,…","link":"https://sekurak.pl/podatnosc-serious-sam-czyli-wpadka-microsoftu-z-uprawnieniami-do-pliku-sam-eskalacja-uprawnien-windows-10-11/","retrieved":1626889399026},{"title":"Gmina Konstancin-Jeziorna w wyniku cyberataku straciła 5 mln PLN. Na celowniku kolejne gminy…","contents":"PAP donosi o następującym oszustwie: 5 mln zł zniknęło z lokaty założonej przez gminę Konstancin Jeziorna w jednym z banków – podaje portal piasecznonews.pl. Nie wiem, czy uda się odzyskać te pieniądze – komentuje burmistrz Kazimierz Jańczuk. Jak czytamy, pod koniec marca gmina założyła w jednym z banków lokatę na…","link":"https://sekurak.pl/gmina-konstancin-jeziorna-w-wyniku-cyberataku-stracila-5-mln-pln-na-celowniku-kolejne-gminy/","retrieved":1626802917062},{"title":"iPhone: zdalne wykonanie kodu bez interakcji z użytkownikiem, czyli niewinna luka z hotspotem „%p%s%s%s%s%n”","contents":"Jakiś czas temu pisaliśmy o ciekawym znalezisku badacza bezpieczeństwa Carla Schou: Dołączenie do hotspota o SSID „%p%s%s%s%s%n” sprawiało, że nasz iPhone nie był w stanie nawiązać połączenia z Wi-Fi, nawet jeśli został on ponownie uruchomiony lub gdy nazwa feralnego hotspota została zmieniona. Według Carla wykorzystanie wyżej wspomnianego błędu w praktyce…","link":"https://sekurak.pl/iphone-zdalne-wykonanie-kodu-bez-interakcji-z-uzytkownikiem-czyli-niewinna-luka-z-hotspotem-pssssn/","retrieved":1626716572706},{"title":"Najnowszy iOS podatny na zdalne hackowanie (i instalację Pegasusa). Wystarczy wysłać jedną złośliwą wiadomość…","contents":"Właśnie rozkręca się nowa afera z Pegasusem – zidentyfikowano ~50 000 numerów telefonicznych, które były w kręgu zainteresowań ~rządów. Na celowniku było m.in. ~180 dziennikarzy: They include the Wall Street Journal, CNN, the New York Times, Al Jazeera, France 24, Radio Free Europe, Mediapart, El País, Associated Press, Le Monde,…","link":"https://sekurak.pl/najnowszy-ios-podatny-na-zdalne-hackowanie-i-instalacje-pegasusa-wystarczy-wyslac-jedna-zlosliwa-wiadomosc/","retrieved":1626672837849},{"title":"DevilsTongue, czyli lepszy Pegasus od izraelskiej firmy Candiru","contents":"Jakiś czas temu pisaliśmy o rosyjskim SWR, które wykorzystywało podatność w Safari do kradzieży ciasteczek autoryzujących z urządzeń ofiar. W raporcie Google’a możemy znaleźć również informacje dotyczące podatności w Google Chrome i Internet Explorer, które „zostały opracowane i sprzedane przez tego samego dostawcę, który zapewnia funkcje nadzoru klientom na całym…","link":"https://sekurak.pl/devilstongue-czyli-lepszy-pegasus-od-izraelskiej-firmy-candiru/","retrieved":1626457388367},{"title":"Rosyjskie SWR atakuje urzędników za pomocą wiadomości LinkedIn z 0-dayem do Safari","contents":"Firma Google udostępniła ciekawy raport dotyczący czterech podatności typu 0-day, obejmujących przeglądarki: Google Chrome, Internet Explorer oraz Safari: Do zaatakowania użytkowników wyżej wymienionego oprogramowania posłużono się czterema exploitami w trzech niepowiązanych ze sobą kampaniach. Najciekawsza z nich dotyczyła wykorzystania podatności w Safari. Służba Wywiadu Zagranicznego Federacji Rosyjskiej (SWR) zaatakowała w…","link":"https://sekurak.pl/rosyjskie-swr-atakuje-urzednikow-za-pomoca-wiadomosci-linkedin-z-0-dayem-do-safari/","retrieved":1626457388368},{"title":"Zdjęto kanały na Telegramie gdzie publikowano treści z włamania na konto min. Dworczyka","contents":"Na razie udało nam się pozyskać dość lakoniczną informację: W wyniku działań podjętych przez KPRM, kanały na których publikowano treści pozyskane w wyniku włamań na skrzynki min. Dworczyka, zostały zablokowane. Procedura trwała około miesiąca, wymagała analizy prawnej i technologicznej. Początkowo zdejmowane były poszczególne wiadomości, na przykład te ze zdjęciami dowodu…","link":"https://sekurak.pl/zdjeto-kanal-na-telegramie-gdzie-publikowano-tresci-z-wlamania-na-konto-min-dworczyka/","retrieved":1626413645879}]}