{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Nigeryjczyk próbował skłonić pracowników dużych firm do instalacji ransomware. Proponowana „pensja” – milion USD.","contents":"Obywatel Nigerii próbował nakłonić pracowników różnych firm do instalacji na serwerach ransomware’a, który zaszyfrowałby dane i ostatecznie „poprosił” o okup. Plan mężczyzny okazał się jednak na tyle niedopracowany, że napisał on do kilku przedsiębiorstw, których poczta była chroniona przez Abnormal Security. Poniższa wiadomość zwróciła uwagę pracowników: Demonware to ransomware napisany…","link":"https://sekurak.pl/nigeryjczyk-probowal-sklonic-pracownikow-duzych-firm-do-instalacji-ransomware-proponowana-pensja-milion-usd/","retrieved":1629783272996},{"title":"Firma Cloudflare odparła rekordowy atak DDoS (17,2 miliona zapytań na sekundę) na infrastrukturę swojego klienta","contents":"Przedsiębiorstwo Cloudflare poinformowało na swoim blogu o rekordowym ataku DDoS na infrastrukturę jednego ze swoich klientów, działających w sektorze finansowym. W szczytowym momencie botnet wysyłał ponad 17 milionów rps (zapytań na sekundę): Cloudflare twierdzi, że atakujący zastosowali wariant botnetu Mirai, składającego się z co najmniej 20 000 urządzeń IoT. Sporo…","link":"https://sekurak.pl/firma-cloudflare-odparla-rekordowy-atak-ddos-172-miliona-zapytan-na-sekunde-na-infrastrukture-swojego-klienta/","retrieved":1629783272996},{"title":"Japońska giełda kryptowalutowa Liquid zhakowana! Przestępcy ukradli ponad 90 milionów dolarów…","contents":"Jakiś czas temu mogliśmy być świadkami jednej z największych kradzieży kryptowalut (600 milionów dolarów) w historii – oczywiście mowa tu o incydencie z Poly Network: Koniec końców, historia zakończyła się happy endem – atakujący zwrócił skradzione środki, firma zaś postanowiła wynagrodzić go kwotą w wysokości 500 tysięcy dolarów oraz zaoferowała…","link":"https://sekurak.pl/japonska-gielda-kryptowalutowa-liquid-zhakowana-przestepcy-ukradli-ponad-90-milionow-dolarow/","retrieved":1629783272996},{"title":"Łamanie hashy haseł w systemach Windows. Team Hashcat stanął do boju i złamał wszystkie hasła.","contents":"W ramach zawodów Crack Me If You Can, odbywających się podczas konferencji DEF CON 6-8 sierpnia, należało przeprowadzić łamanie haseł z różnych systemów. Zespół, pod nazwą Team Hashcat, odpowiedzialny za narzędzie hashcat (którego zastosowanie zostało omówione na SekurakTV), podzielił się swoim write-upem. W tym roku organizator (firma KoreLogic) zamiast listy…","link":"https://sekurak.pl/lamanie-hashy-hasel-w-systemach-windows-team-hachcat-stanal-do-boju-i-zlamal-wszystkie-hasla/","retrieved":1629783272997},{"title":"FortiWeb (WAF od Fortinet) z krytyczną luką OS Command Injection – można wykonywać dowolne polecenia systemowe jako root","contents":"Na wstępie mamy dla Was dobrą wiadomość – luka wymaga od atakującego uprzedniego uwierzytelnienia: Luka w interfejsie zarządzania FortiWeb (wersja 6.3.11 i wcześniejsze) umożliwia atakującemu wykonanie dowolnych poleceń systemowych jako root. Za całe zamieszanie odpowiedzialny jest następujący fragment kodu: int move_metafile(char *path,char *name){int iVar1;char buf [512];int nret;snprintf(buf,0x200,”%s/%s”,”/data/etc/saml/shibboleth/service_providers”,name);iVar1 = access(buf,0);if (iVar1…","link":"https://sekurak.pl/fortiweb-waf-od-fortinet-z-krytyczna-luka-os-command-injection-mozna-wykonywac-dowolne-polecenia-systemowe-jako-root/","retrieved":1629783272999},{"title":"Wyciekły dane z sekretnej listy FBI, zawierającej ponad milion rekordów z informacjami o potencjalnych terrorystach","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą tweeta badacza bezpieczeństwa Boba Diachenki: Po atakach terrorystycznych z 11 września 2001 r. w Stanach Zjednoczonych utworzono TSC (Terrorist Screening Center), czyli wieloagencyjne centrum zarządzane przez FBI, którego głównym zadaniem jest uzupełnianie listy osób podejrzewanych o terroryzm i zarządzanie nią. Powyższe dane…","link":"https://sekurak.pl/wyciekly-dane-z-sekretnej-listy-fbi-zawierajacej-ponad-milion-rekordow-z-informacjami-o-potencjalnych-terrorystach/","retrieved":1629394893700},{"title":"Energetyczne, angażujące i aktualne szkolenie cyberawareness od sekuraka","contents":"Obawiacie się, że Wasi pracownicy mogą paść ofiarą socjotechniki/phishingu? Może przeleją firmowe pieniądze na konto przestępców? Nieświadomie wpuszczą ransomware do Waszej sieci? Albo udostępnią poufne informacje firmowe nieznajomym? Co z bezpieczeństwem smartfonów? Jeśli intrygują Was tego typu pytania, zobaczcie na nasze szkolenie cyberawareness przeznaczone dla osób nietechnicznych: bezpieczny.sekurak.pl Szkolenie sami…","link":"https://sekurak.pl/energetyczne-angazujace-i-aktualne-szkolenie-cyberawareness-od-sekuraka/","retrieved":1629394893702},{"title":"T-Mobile zhakowane – dane ponad 30 milionów klientów z USA są licytowane na forum cyberprzestępczym","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą oficjalnego oświadczenia, jakie firma T-Mobile zamieściła na swojej stronie internetowej: Z treści wypowiedzi wynika, że choć nieuprawniony dostęp do serwerów T-Mobile rzeczywiście miał miejsce, to firma nie ustaliła jeszcze, czy dane jej klientów zostały wykradzione.&nbsp; Niestety, jak informuje portal Vice, nielegalnie pozyskane…","link":"https://sekurak.pl/t-mobile-zhakowane-dane-ponad-30-milionow-klientow-z-usa-sa-licytowane-na-forum-cyberprzestepczym/","retrieved":1629308504017},{"title":"Policja aresztowała trzech Gruzinów podszywających się pod dostawców energii elektrycznej. Przestępcy ukradli ponad 450 tys. zł","contents":"Jeśli śledzicie na bieżąco kampanie cyberprzestępcze wycelowane w Polskę, to na pewno zetknęliście się z SMS-ami od „PGE” czy „Taurona”: Policjantom z Biura do Walki z Cyberprzestępczością Komendy Głównej Policji udało się jednak zatrzymać trzech obywateli Gruzji, którzy, podszywając się pod dużych dostawców energii elektrycznej, wyłudzali dane umożliwiające logowanie do…","link":"https://sekurak.pl/policja-aresztowala-trzech-gruzinow-podszywajacych-sie-pod-dostawcow-energii-elektrycznej-przestepcy-ukradli-ponad-450-tys-zl/","retrieved":1629308504018},{"title":"„Roboty z laserami, kamerami oraz brakiem zabezpieczeń” czyli hackowanie inteligentnych odkurzaczy","contents":"Podczas tegorocznej konferencji DEF CON Dennis Giese zaprezentował reverse engineering tzw. inteligentnych odkurzaczy produkowanych przez firmy Xiaomi i Roborock. Zapis prezentacji Robots with lasers and cameras (but no security): Liberating your vacuum został opublikowany na YouTubie. Badacz obecnie jest studentem Northeastern University; interesuje się inżynierią wsteczną. W prezentacji wyjaśniono, że…","link":"https://sekurak.pl/roboty-z-laserami-i-kamerami-i-brakiem-zabezpieczen-czyli-hackowanie-inteligentnych-odkurzaczy/","retrieved":1629135728445},{"title":"Facebook wprowadza szyfrowanie e2e rozmów głosowych i czatów wideo w Messengerze","contents":"Kilka dni temu dyrektor ds. zarządzania produktem (Messenger) Ruth Kricheli ogłosił dość ciekawe dla miłośników prywatności zmiany w komunikatorze Messenger: Pierwszą nowością jest szyfrowanie e2e (end-to-end) rozmów głosowych i wideo w Messengerze. W praktyce oznacza to, że nikt, w tym Facebook, nie powinien być w stanie podsłuchiwać treści naszych rozmów….","link":"https://sekurak.pl/facebook-wprowadza-szyfrowanie-e2e-rozmow-glosowych-i-czatow-wideo-w-messengerze/","retrieved":1629135728446},{"title":"Dziesiątki milionów urządzeń Amazon Kindle z krytyczną podatnością; poprawka gotowa i instalowana automatycznie","contents":"Researcherzy firmy Checkpoint wzięli jakiś czas temu pod lupę urządzenia Kindle firmy Amazon. Efekty ich pracy są bardzo ciekawe. Na podstawie ujawnionych podatności możliwe było przejęcie pełnej kontroli nad każdym tego typu urządzeniem. Po pobraniu na czytnik specjalnie spreparowanego e-booka (ileż to darmowych „okazji” krąży w sieci – tylko pobierać!)…","link":"https://sekurak.pl/dziesiatki-milionow-urzadzen-amazon-kindle-z-krytyczna-podatnoscia-poprawka-gotowa-i-instalowana-automatycznie/","retrieved":1628919272734},{"title":"Apple wprowadza masową inwigilację swoich użytkowników pod pozorem ochrony dzieci","contents":"Jeśli jesteście posiadaczami urządzeń z systemami iOS czy macOS, to prawdopodobnie jedną z wartości, którą sobie cenicie, stanowi prywatność. Szczyci się nią sama firma Apple: Niestety, ostatnia zapowiedź Apple’a nie rokuje zbyt dobrze w kontekście dbałości o prywatność użytkowników iOS’ów i macOS’ów: Pamiętacie próby przeforsowania ustaw o dodaniu furtek w…","link":"https://sekurak.pl/apple-wprowadza-masowa-inwigilacje-swoich-uzytkownikow-pod-pozorem-ochrony-dzieci/","retrieved":1628919272735},{"title":"Wprowadzenie do bezpieczeństwa IT – zobacz spis treści nowej książki sekuraka! :)","contents":"Po sukcesie pierwszej książki: Bezpieczeństwo aplikacji webowych (sprzedanych przeszło 16 000 sztuk), czas na drugą: Wprowadzenie do bezpieczeństwa IT. W założeniu książka kierowana jest do… wszystkich osób z IT :) i ma stanowić gładkie wprowadzenie do niemal każdego tematu, który można rozważać w ramach IT security. Przy czym nie ma…","link":"https://sekurak.pl/wprowadzenie-do-bezpieczenstwa-it-zobacz-spis-tresci-nowej-ksiazki-sekuraka/","retrieved":1628919272737},{"title":"Jak można było sobie dowolnie zwiększyć saldo portfela na platformie Steam? Krytyczna luka w Smart2Pay","contents":"Steam to jedna z największych i najpopularniejszych platform do dystrybucji cyfrowej gier komputerowych, stworzona przez Valve Corporation w 2003 roku. Jeśli jesteś graczem, to prawdopodobnie korzystasz z tego serwisu na co dzień… Oczywiście za gry w większości przypadków przyjdzie nam zapłacić, i to niemało, bo często nawet ~ 200 PLN:…","link":"https://sekurak.pl/jak-mozna-bylo-sobie-dowolnie-zwiekszyc-saldo-portfela-na-platformie-steam-krytyczna-luka-w-smart2pay/","retrieved":1628789977494}]}