{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Zdalne wykonanie kodu w Burp Suite, czyli jak zhakować hakera","contents":"Burp Suite to popularne narzędzie pozwalające na przeprowadzanie testów bezpieczeństwa aplikacji internetowych. Więcej na temat tego oprogramowania pisaliśmy w artykule z 2014 roku. Tymczasem badacze bezpieczeństwa z Noah Lab odkryli podatność, która pozwala na zdalne wykonanie kodu na urządzeniu użytkownika Burp Suite: Luka dotyczy wykorzystywania przez oprogramowanie bezokienkowej wersji przeglądarki…","link":"https://sekurak.pl/zdalne-wykonanie-kodu-w-burp-suite-czyli-jak-zhakowac-hakera/","retrieved":1631209277551},{"title":"OWASP Top 10 – edycja 2021. Idą duże zmiany.","contents":"OWASP Top Ten to często pierwszy dokument polecany osobom, które chcą bezboleśnie rozpocząć swoją przygodę z bezpieczeństwem aplikacji webowych. To 10 najistotniejszych kategorii problemów bezpieczeństwa w aplikacjach webowych: The OWASP Top 10 is a standard awareness document for developers and web application security. It represents a broad consensus about the…","link":"https://sekurak.pl/owasp-top-10-edycja-2021-ida-duze-zmiany/","retrieved":1631209277553},{"title":"McDonald’s UK: w mailach do uczestników gry znalazły się… loginy/hasła do baz danych","contents":"Monopoly VIP to gra udostępniana klientom McDonalda w Wielkiej Brytanii. W skrócie można wpisać tam kod dostępny po zakupie produktów i dzięki temu wygrać nagrody. Część osób, która rzeczywiście je wygrała, dostała w informującym o fakcie e-mailu pewien bonus: dane logowania do produkcyjnej/stagingowej bazy danych: Hasło do bazy w treści…","link":"https://sekurak.pl/mcdonald-uk-w-mailach-do-uczestnikow-gry-znalazly-sie-loginy-hasla-do-baz-danych/","retrieved":1631122904056},{"title":"Bezpieczeństwo frontendu aplikacji webowych – zapraszamy na unikalne szkolenie Michała Bentkowskiego","contents":"Jeśli interesują Was szkolenia dedykowane programistom/testerom/pentesterom to zapraszamy do odwiedzenia naszego nowego projektu: Securitum Web Lab (https://weblab.securitum.pl/). Bezpieczeństwo frontendu aplikacji webowych to jedno ze szkoleń, które tam Wam proponujemy. Prowadzi je Michał Bentkowski, topowy pentester i badacz bezpieczeństwa – który do samego Google zgłosił przeszło 20 podatności, za które otrzymał…","link":"https://sekurak.pl/bezpieczenstwo-frontendu-aplikacji-webowych-zapraszamy-na-unikalne-szkolenie-michala-bentkowskiego/","retrieved":1631122904059},{"title":"Podatność w  samochodach marki Honda – wg badacza można sprytnym atakiem bezprzewodowo otworzyć samochód","contents":"Całkiem ciekawy, chociaż nie nowy sposób zdalnego ataku na samochody marki Honda został opisany w tym miejscu. To tzw. replay attack, który polega na kilkukrotnym lub opóźnionym wysyłaniu poprawnych danych. Według autora prawdopodobnie działa on w wypadku wszystkich modeli marek Honda/Acura wyposażonych w tę funkcję: This attack seems to affect…","link":"https://sekurak.pl/podatnosc-w-samochodach-marki-honda-wg-badacza-mozna-sprytnym-atakiem-bezprzewodowo-otworzyc-samochod/","retrieved":1631122904060},{"title":"Uwaga: podatność 0-day w Microsoft Office. Producent ostrzega o aktywnej eksploitacji!","contents":"Mowa o CVE-2021-40444. Atakujący przygotowują odpowiednie pliki .docx które po otwarciu przez ofiarę umożliwiają przejęcie jej komputera. Microsoft opisuje to w ten sposób: An attacker could craft a malicious ActiveX control to be used by a Microsoft Office document that hosts the browser rendering engine. The attacker would then have…","link":"https://sekurak.pl/uwaga-podatnosc-0-day-w-microsoft-office-producent-ostrzega-o-aktywnej-eksploitacji/","retrieved":1631122904062},{"title":"Aresztowano developera trojana bankowego TrickBot. Ucieczkę do Rosji uniemożliwiły lockdown i nieważny paszport…","contents":"TrickBot został zauważony po raz pierwszy w październiku 2016 roku i miał on postać trojana bankowego. Z czasem złośliwe oprogramowanie wzbogacono o nowe moduły, takie jak np. „dropper”, którego główną rolą jest zapewnienie „tylnej furtki” dla innego złośliwego oprogramowania. Z funkcji tej korzystało między innymi Ryuk Ransomware, znane z ataków…","link":"https://sekurak.pl/aresztowano-developera-trojana-bankowego-trickbot-ucieczke-do-rosji-uniemozliwily-lockdown-i-niewazny-paszport/","retrieved":1631122904067},{"title":"Co każdy administrator powinien wiedzieć o bezpieczeństwie Windows? Zapraszamy na praktyczny cykl szkoleń od sekuraka","contents":"Znakiem rozpoznawczym Grześka Tworka (prowadzącego kurs o bezpieczeństwie Windows) jest maksimum praktyki, minimum teorii oraz rozległa wiedza z dziedziny bezpieczeństwa systemów windowsowych. Grzegorz w czasie ponaddwudziestoletniej kariery zawodowej zarządzał czterema zbudowanymi od podstaw zespołami ekspertów IT Security, napisał dziesiątki narzędzi, znajdował bugi w kodzie systemów Windows, jednych hackerów wsadzał do…","link":"https://sekurak.pl/co-kazdy-administrator-powinien-wiedziec-o-bezpieczenstwie-windows-zapraszamy-na-praktyczny-cykl-szkolen-od-sekuraka/","retrieved":1631122904072},{"title":"Niemiecki rząd chce, aby producenci smartfonów wspierali swoje urządzenia przez minimum siedem lat","contents":"Ten pomysł przedstawił niemiecki rząd w negocjacjach z Komisją Europejską. Aktualizacje systemów operacyjnych i wsparcie serwisowe dla smartfonów ma wynosić siedem lat, a w wypadku tabletów – pięć lat. Pomysł KE zakładał pomoc w obu tych aspektach przez pięć lat dla smartfonów i sześć lat odnośnie do tabletów. W dodatku…","link":"https://sekurak.pl/niemiecki-rzad-chce-aby-producenci-smartfonow-wspierali-swoje-urzadzenia-przez-minimum-siedem-lat/","retrieved":1631122904074},{"title":"ProtonMail wydał adres IP aktywisty z Francji","contents":"Jak donosi portal “secoursrouge.org”, serwis ProtonMail miał wydać organom ścigania adres IP francuskiego aktywisty z ruchu “Youth for Climate” (Młodzieżowy Strajk Klimatyczny): Zastanówmy się najpierw, czy wydanie adresu IP przez Protona było faktycznie złamaniem “zasad” serwisu? Więcej na ten temat możemy znaleźć na podstronie protonmail.com/privacy-policy: Jak możemy przeczytać w polityce…","link":"https://sekurak.pl/protonmail-wydal-adres-ip-aktywisty-z-francji/","retrieved":1630992893032},{"title":"Kod źródłowy ransomware’a Babuk wyciekł do sieci. Powód? „U developera wykryto raka płuc”","contents":"O Babuku zrobiło się głośno po udanym ataku na główną jednostkę policji w Waszyngtonie, w wyniku którego wykradziono i zaszyfrowano ponad 250 GB danych:&nbsp; Ta sama grupa, pod szyldem Payload.bin, opublikowała również kody źródłowe należące do CD Projekt Red: Z kolei jakiś czas temu jeden z (byłych?) operatorów grupy Babuk…","link":"https://sekurak.pl/kod-zrodlowy-ransomwarea-babuk-wyciekl-do-sieci-powod-u-developera-wykryto-raka-pluc/","retrieved":1630992893034},{"title":"Apple pod wpływem krytyki opóźnia wprowadzenie masowej inwigilacji (skanowanie CSAM)","contents":"W sierpniu tego roku pisaliśmy o kontrowersyjnej zmianie, jaką Apple zamierza wprowadzić w wypadku urządzeń z systemami iOS i macOS. W dużym skrócie – firma zapowiedziała, że w celu ochrony dzieci uruchomi skanowanie „nieodpowiednich” treści znajdujących się w chmurze iCloud oraz bezpośrednio w urządzeniach użytkowników: W praktyce takie działanie może…","link":"https://sekurak.pl/apple-pod-wplywem-krytyki-opoznia-wprowadzenie-masowej-inwigilacji-skanowanie-csam/","retrieved":1630992893035},{"title":"Uwaga. Odbywa się masowe wykorzystywanie krytycznej podatności w Atlassian Confluence. Łatajcie ASAP!","contents":"O temacie donosi m.in. USCYBERCOM: Podatność prawdopodobnie może być wykorzystania bez uwierzytelnienia, a finalnie daje możliwość wykonywania poleceń w systemie operacyjnym (RCE): Nieco więcej o tej krytycznej luce (wycena 9.8/10 w skali CVSS) można znaleźć na stronie producenta. –ms","link":"https://sekurak.pl/uwaga-odbywa-sie-masowe-wykorzystywanie-krytycznej-podatnosci-w-atlassian-confluence-latajcie-asap/","retrieved":1630690894155},{"title":"Talibowie mogą posiadać dane biometryczne Amerykanów","contents":"Z opisanych tutaj doniesień Agencji Reutera wynika, że talibowie mogą być w posiadaniu danych biometrycznych zebranych przez Amerykanów i dotyczących Afgańczyków, samych żołnierzy i sił koalicyjnych. Jak się okazuje, już po zamachach z 11 września 2001 roku dane biometryczne zaczęły być dla Amerykanów cennym zasobem, bo pozwalały na „śledzenie” celów….","link":"https://sekurak.pl/talibowie-moga-posiadac-dane-biometryczne-amerykanow/","retrieved":1630690894155},{"title":"WhatsApp z grzywną 225 milionów euro za naruszenie prywatności użytkowników","contents":"Irlandzka Komisja Ochrony Danych (Data Protection Commission) ogłosiła, że WhatsApp należący do Facebooka zostanie ukarany grzywną w wysokości 225 milionów euro w związku z naruszeniem prywatności użytkowników komunikatora: Według DPC WhatsApp niewłaściwe informował użytkowników, w jaki sposób ich dane będą wykorzystywane przez Facebooka. Z raportu Komisji wynika, że naruszone zostały…","link":"https://sekurak.pl/whatsapp-z-grzywna-225-milionow-euro-za-naruszenie-prywatnosci-uzytkownikow/","retrieved":1630690894156}]}