{"title":"Sekurak","url":"https://sekurak.pl/?cat=7,3","favicon":"https://sekurak.pl/wp-content/themes/Sekuraq/img/favicon.ico","elements":[{"title":"Grupa ransomware RansomEXX zhakowała dostawcę oprogramowania układowego American Megatrends","contents":"AMI (American Megatrends International LLC, dawniej American Megatrends Inc.) to międzynarodowe przedsiębiorstwo zajmujące się między innymi produkcją sprzętu komputerowego i dostarczaniem oprogramowania układowego. W Polsce firma znana jest dzięki systemowi BIOS ich autorstwa: Niestety American Megatrends stało się, zaraz obok firmy Gigabyte, kolejną ofiarą grupy ransomware RansomEXX: Atakujący prawdopodobnie nie…","link":"https://sekurak.pl/grupa-ransomware-ransomexx-zhakowala-dostawce-oprogramowania-ukladowego-american-megatrends/","retrieved":1630431667210},{"title":"Badacze znaleźli krytyczną lukę w zabezpieczeniach Azure Cosmos DB. Microsoft wysyła do użytkowników e-maile z ostrzeżeniami","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą raportu od zespołu Wiz Research:&nbsp; Usługa Azure Cosmos DB to w pełni zarządzana usługa bazy danych NoSQL umożliwiająca tworzenie nowoczesnych aplikacji: Luka znaleziona przez badaczy umożliwiała atakującemu uzyskanie pełnego dostępu (odczyt, zapis, usuwanie) do instancji Cosmos DB innych klientów bez uprzedniej autoryzacji….","link":"https://sekurak.pl/badacze-znalezli-krytyczna-luke-w-zabezpieczeniach-azure-cosmos-db-microsoft-wysyla-do-uzytkownikow-e-maile-z-ostrzezeniami/","retrieved":1630431667210},{"title":"Kuba: rząd przepchnął ustawę cenzurującą Internet w kraju. Od teraz krytyka reżimu to „cyberterroryzm”.","contents":"W lipcu informowaliśmy was o blackoucie Internetu i blokadzie mediów społecznościowych w trakcie antyrządowych protestów na Kubie: Tym razem reżim poszedł o krok dalej, uchwalając nowe przepisy, pozwalające na ograniczanie wolność wypowiedzi w Internecie. Dodatkowo rząd Kuby wprowadził jednoznaczny zapis, który zmusza dostawców usług internetowych do zgłaszania wszelkich incydentów bezpieczeństwa…","link":"https://sekurak.pl/kuba-rzad-przepchnal-ustawe-cenzurujaca-internet-w-kraju-od-teraz-krytyka-rezimu-to-cyberterroryzm/","retrieved":1630172395143},{"title":"Ekipę Ragnarok ransomware ruszyło sumienie (lub FBI ;) – udostępnili klucze deszyfrujące wszystkie ofiary","contents":"Jak donosi ekipa Bleepingcomputer, Rangarok w panice ~opuścił swój serwis publikujący informacje o ofiarach / wyciekach: Looking at the leak site, it seems like the gang did not plan on shutting down today, and just wiped everything and shut down their operation. Jednocześnie w tym serwisie udostępniono uniwersalnego dekryptora. Badacze…","link":"https://sekurak.pl/ekipe-ragnarok-ransomware-ruszylo-sumienie-lub-fbi-udostepnili-klucze-deszyfrujace-wszystkie-ofiary/","retrieved":1630172395143},{"title":"Wygrałeś 1000 zł w Loterii Narodowego Programu Szczepień! Potwierdź wygraną, podając przestępcom dane do konta bankowego…","contents":"Kilka dni temu informowaliśmy Was o aresztowaniu grupy przestępczej, która, podszywając się pod dostawców energii elektrycznej, rozsyłała SMS-y przekierowujące do fałszywej bramki płatności wyłudzającej dane dostępowe do kont bankowych ofiar: Niestety, wizja szybkiego wzbogacenia się małym nakładem „pracy” zmotywowała innych cyberprzestępców do kontynuowania kampanii. Tym razem pretekstem stał się odbiór…","link":"https://sekurak.pl/wygrales-1000-zl-w-loterii-narodowego-programu-szczepien-potwierdz-wygrana-podajac-przestepcom-dane-do-konta-bankowego/","retrieved":1630172395144},{"title":"Exploit zero-click w iPhonie używany do infekcji Pegasusem","contents":"Badacze z firmy Citizen Lab informują o wykryciu programu Pegasus zainstalowanego na urządzeniach iPhone dziewięciu aktywistów z Bahrajnu. Do infekcji doszło przy użyciu exploitów zero-click (czyli takich, które nie wymagają żadnej interakcji ze strony ofiary) na aplikację iMessage. Wykorzystano znaną od 2020 roku podatność KISMET oraz exploit FORCEDENTRY wykryty w…","link":"https://sekurak.pl/exploit-zero-click-w-iphonie-uzywany-do-infekcji-pegasusem/","retrieved":1630172395145},{"title":"Nigeryjczyk próbował skłonić pracowników dużych firm do instalacji ransomware. Proponowana „pensja” – milion USD.","contents":"Obywatel Nigerii próbował nakłonić pracowników różnych firm do instalacji na serwerach ransomware’a, który zaszyfrowałby dane i ostatecznie „poprosił” o okup. Plan mężczyzny okazał się jednak na tyle niedopracowany, że napisał on do kilku przedsiębiorstw, których poczta była chroniona przez Abnormal Security. Poniższa wiadomość zwróciła uwagę pracowników: Demonware to ransomware napisany…","link":"https://sekurak.pl/nigeryjczyk-probowal-sklonic-pracownikow-duzych-firm-do-instalacji-ransomware-proponowana-pensja-milion-usd/","retrieved":1629783272996},{"title":"Firma Cloudflare odparła rekordowy atak DDoS (17,2 miliona zapytań na sekundę) na infrastrukturę swojego klienta","contents":"Przedsiębiorstwo Cloudflare poinformowało na swoim blogu o rekordowym ataku DDoS na infrastrukturę jednego ze swoich klientów, działających w sektorze finansowym. W szczytowym momencie botnet wysyłał ponad 17 milionów rps (zapytań na sekundę): Cloudflare twierdzi, że atakujący zastosowali wariant botnetu Mirai, składającego się z co najmniej 20 000 urządzeń IoT. Sporo…","link":"https://sekurak.pl/firma-cloudflare-odparla-rekordowy-atak-ddos-172-miliona-zapytan-na-sekunde-na-infrastrukture-swojego-klienta/","retrieved":1629783272996},{"title":"Japońska giełda kryptowalutowa Liquid zhakowana! Przestępcy ukradli ponad 90 milionów dolarów…","contents":"Jakiś czas temu mogliśmy być świadkami jednej z największych kradzieży kryptowalut (600 milionów dolarów) w historii – oczywiście mowa tu o incydencie z Poly Network: Koniec końców, historia zakończyła się happy endem – atakujący zwrócił skradzione środki, firma zaś postanowiła wynagrodzić go kwotą w wysokości 500 tysięcy dolarów oraz zaoferowała…","link":"https://sekurak.pl/japonska-gielda-kryptowalutowa-liquid-zhakowana-przestepcy-ukradli-ponad-90-milionow-dolarow/","retrieved":1629783272996},{"title":"Łamanie hashy haseł w systemach Windows. Team Hashcat stanął do boju i złamał wszystkie hasła.","contents":"W ramach zawodów Crack Me If You Can, odbywających się podczas konferencji DEF CON 6-8 sierpnia, należało przeprowadzić łamanie haseł z różnych systemów. Zespół, pod nazwą Team Hashcat, odpowiedzialny za narzędzie hashcat (którego zastosowanie zostało omówione na SekurakTV), podzielił się swoim write-upem. W tym roku organizator (firma KoreLogic) zamiast listy…","link":"https://sekurak.pl/lamanie-hashy-hasel-w-systemach-windows-team-hachcat-stanal-do-boju-i-zlamal-wszystkie-hasla/","retrieved":1629783272997},{"title":"FortiWeb (WAF od Fortinet) z krytyczną luką OS Command Injection – można wykonywać dowolne polecenia systemowe jako root","contents":"Na wstępie mamy dla Was dobrą wiadomość – luka wymaga od atakującego uprzedniego uwierzytelnienia: Luka w interfejsie zarządzania FortiWeb (wersja 6.3.11 i wcześniejsze) umożliwia atakującemu wykonanie dowolnych poleceń systemowych jako root. Za całe zamieszanie odpowiedzialny jest następujący fragment kodu: int move_metafile(char *path,char *name){int iVar1;char buf [512];int nret;snprintf(buf,0x200,”%s/%s”,”/data/etc/saml/shibboleth/service_providers”,name);iVar1 = access(buf,0);if (iVar1…","link":"https://sekurak.pl/fortiweb-waf-od-fortinet-z-krytyczna-luka-os-command-injection-mozna-wykonywac-dowolne-polecenia-systemowe-jako-root/","retrieved":1629783272999},{"title":"Wyciekły dane z sekretnej listy FBI, zawierającej ponad milion rekordów z informacjami o potencjalnych terrorystach","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą tweeta badacza bezpieczeństwa Boba Diachenki: Po atakach terrorystycznych z 11 września 2001 r. w Stanach Zjednoczonych utworzono TSC (Terrorist Screening Center), czyli wieloagencyjne centrum zarządzane przez FBI, którego głównym zadaniem jest uzupełnianie listy osób podejrzewanych o terroryzm i zarządzanie nią. Powyższe dane…","link":"https://sekurak.pl/wyciekly-dane-z-sekretnej-listy-fbi-zawierajacej-ponad-milion-rekordow-z-informacjami-o-potencjalnych-terrorystach/","retrieved":1629394893700},{"title":"Energetyczne, angażujące i aktualne szkolenie cyberawareness od sekuraka","contents":"Obawiacie się, że Wasi pracownicy mogą paść ofiarą socjotechniki/phishingu? Może przeleją firmowe pieniądze na konto przestępców? Nieświadomie wpuszczą ransomware do Waszej sieci? Albo udostępnią poufne informacje firmowe nieznajomym? Co z bezpieczeństwem smartfonów? Jeśli intrygują Was tego typu pytania, zobaczcie na nasze szkolenie cyberawareness przeznaczone dla osób nietechnicznych: bezpieczny.sekurak.pl Szkolenie sami…","link":"https://sekurak.pl/energetyczne-angazujace-i-aktualne-szkolenie-cyberawareness-od-sekuraka/","retrieved":1629394893702},{"title":"T-Mobile zhakowane – dane ponad 30 milionów klientów z USA są licytowane na forum cyberprzestępczym","contents":"O całym zajściu mogliśmy dowiedzieć się za sprawą oficjalnego oświadczenia, jakie firma T-Mobile zamieściła na swojej stronie internetowej: Z treści wypowiedzi wynika, że choć nieuprawniony dostęp do serwerów T-Mobile rzeczywiście miał miejsce, to firma nie ustaliła jeszcze, czy dane jej klientów zostały wykradzione.&nbsp; Niestety, jak informuje portal Vice, nielegalnie pozyskane…","link":"https://sekurak.pl/t-mobile-zhakowane-dane-ponad-30-milionow-klientow-z-usa-sa-licytowane-na-forum-cyberprzestepczym/","retrieved":1629308504017},{"title":"Policja aresztowała trzech Gruzinów podszywających się pod dostawców energii elektrycznej. Przestępcy ukradli ponad 450 tys. zł","contents":"Jeśli śledzicie na bieżąco kampanie cyberprzestępcze wycelowane w Polskę, to na pewno zetknęliście się z SMS-ami od „PGE” czy „Taurona”: Policjantom z Biura do Walki z Cyberprzestępczością Komendy Głównej Policji udało się jednak zatrzymać trzech obywateli Gruzji, którzy, podszywając się pod dużych dostawców energii elektrycznej, wyłudzali dane umożliwiające logowanie do…","link":"https://sekurak.pl/policja-aresztowala-trzech-gruzinow-podszywajacych-sie-pod-dostawcow-energii-elektrycznej-przestepcy-ukradli-ponad-450-tys-zl/","retrieved":1629308504018}]}